{
  "CosmosDbEntity": "managementTemplate",
  "priority": 8,
  "category": 1,
  "provider": 0,
  "version": 0,
  "displayName": "Configure Microsoft Defender Antivirus",
  "description": "Microsoft Defender Antivirus is built into Windows 10 and later and helps protect devices from viruses, malware, and other threats. Make sure that the Windows devices that access organizational resources are protected by configuring Microsoft Defender Antivirus with Microsoft Intune.",
  "userImpact": "Microsoft Defender Antivirus runs in the background, ensuring that Windows users are protected from threats, such as viruses and malware.",
  "informationLinks": [],
  "id": "eb9b38d7-f88a-4a35-96b2-22399e1e364f",
  "managementTemplateSteps": [
    {
      "CosmosDbEntity": "managementTemplateStep",
      "priority": 0,
      "category": 0,
      "isCloned": true,
      "displayName": "Configure Microsoft Defender Antivirus for Windows 10 and later",
      "portalLink": {
        "url": "https://endpoint.microsoft.com/{tenantName}/#blade/Microsoft_Intune_Workflows/SecurityManagementMenu/antivirus",
        "displayName": "Microsoft Intune"
      },
      "userImpact": "Microsoft Defender Antivirus runs in the background, ensuring that Windows users are protected from threats, such as viruses and malware.",
      "informationLinks": [
        {
          "url": "https://go.microsoft.com/fwlink/?linkid=2185841",
          "displayName": "How malware can infect your PC"
        }
      ],
      "id": "bd16eb12-50af-4198-a1c4-921c5e854bc3",
      "versions": [
        {
          "CosmosDbEntity": "managementTemplateStepVersion",
          "name": "Defender-1",
          "version": 1,
          "similarToDefaultBaselineTaskSetting": false,
          "matchingDefaultBaselineSubtaskId": "",
          "settings": [
            {
              "name": "name",
              "value": "M365 Lighthouse - Setup Microsoft Defender Antivirus Policy for Windows 10 devices",
              "isRequired": true,
              "isReadOnly": true,
              "displayName": "Name"
            },
            {
              "name": "pUAProtection",
              "value": "[\"device_vendor_msft_policy_config_defender_puaprotection_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "PUAProtection_Off",
                  "displayName": "PUA Protection off. Windows Defender will not protect against potentially unwanted applications."
                },
                {
                  "name": "PUAProtection_On",
                  "displayName": "PUA Protection on. Detected items are blocked. They will show in history along with other threats."
                },
                {
                  "name": "PUAProtection_AuditMode",
                  "displayName": "Audit mode. Windows Defender will detect potentially unwanted applications, but take no action. You can review information about the applications Windows Defender would have taken action against by searching for events created by Windows Defender in the Event Viewer."
                }
              ],
              "displayName": "PUA Protection"
            },
            {
              "name": "cloudBlockLevel",
              "value": "[\"device_vendor_msft_policy_config_defender_cloudblocklevel_2\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "CloudBlockLevel_NotConfigured",
                  "displayName": "Not Configured"
                },
                {
                  "name": "CloudBlockLevel_High",
                  "displayName": "High"
                },
                {
                  "name": "CloudBlockLevel_HighPlus",
                  "displayName": "High Plus"
                },
                {
                  "name": "CloudBlockLevel_ZeroTolerance",
                  "displayName": "Zero Tolerance"
                }
              ],
              "displayName": "Cloud Block Level"
            },
            {
              "name": "enableNetworkProtection",
              "value": "[\"device_vendor_msft_policy_config_defender_enablenetworkprotection_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "EnableNetworkProtection_Disabled",
                  "displayName": "Disabled"
                },
                {
                  "name": "EnableNetworkProtection_EnabledBlockMode",
                  "displayName": "Enabled (block mode)"
                },
                {
                  "name": "EnableNetworkProtection_EnabledAuditMode",
                  "displayName": "Enabled (audit mode)"
                }
              ],
              "displayName": "Enable Network Protection"
            },
            {
              "name": "allowRealtimeMonitoring",
              "value": "[\"device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "AllowRealtimeMonitoring_NotAllowed",
                  "displayName": "Not allowed. Turns off the real-time monitoring service."
                },
                {
                  "name": "AllowRealtimeMonitoring_Allowed",
                  "displayName": "Allowed. Turns on and runs the real-time monitoring service."
                }
              ],
              "displayName": "Allow Real-time Monitoring"
            },
            {
              "name": "scheduleScanDay",
              "value": "[\"device_vendor_msft_policy_config_defender_schedulescanday_2\"]",
              "isRequired": true,
              "isReadOnly": true,
              "referenceStrings": [
                {
                  "name": "ScheduleScanDay_EveryDay",
                  "displayName": "Every day"
                },
                {
                  "name": "ScheduleScanDay_Sunday",
                  "displayName": "Sunday"
                },
                {
                  "name": "ScheduleScanDay_Monday",
                  "displayName": "Monday"
                },
                {
                  "name": "ScheduleScanDay_Tuesday",
                  "displayName": "Tuesday"
                },
                {
                  "name": "ScheduleScanDay_Wednesday",
                  "displayName": "Wednesday"
                },
                {
                  "name": "ScheduleScanDay_Thursday",
                  "displayName": "Thursday"
                },
                {
                  "name": "ScheduleScanDay_Friday",
                  "displayName": "Friday"
                },
                {
                  "name": "ScheduleScanDay_Saturday",
                  "displayName": "Saturday"
                },
                {
                  "name": "ScheduleScanDay_NoScheduledScan",
                  "displayName": "No scheduled scan"
                }
              ],
              "displayName": "Schedule Scan Day"
            },
            {
              "name": "scanParameter",
              "value": "[\"device_vendor_msft_policy_config_defender_scanparameter_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "referenceStrings": [
                {
                  "name": "ScanParameter_QuickScan",
                  "displayName": "Quick scan"
                },
                {
                  "name": "ScanParameter_FullScan",
                  "displayName": "Full scan"
                }
              ],
              "displayName": "Scan Parameter"
            },
            {
              "name": "allowArchiveScanning",
              "value": "[\"device_vendor_msft_policy_config_defender_allowarchivescanning_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "AllowArchiveScanning_NotAllowed",
                  "displayName": "Not allowed. Turns off scanning on archived files."
                },
                {
                  "name": "AllowArchiveScanning_Allowed",
                  "displayName": "Allowed. Scans the archive files."
                }
              ],
              "displayName": "Allow Archive Scanning"
            },
            {
              "name": "enableLowCPUPriority",
              "value": "[\"device_vendor_msft_policy_config_defender_enablelowcpupriority_0\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "EnableLowCPUPriority_Disabled",
                  "displayName": "Disabled"
                },
                {
                  "name": "EnableLowCPUPriority_Enabled",
                  "displayName": "Enabled"
                }
              ],
              "displayName": "Enable Low CPU Priority"
            },
            {
              "name": "disableCatchUpFullScan",
              "value": "[\"device_vendor_msft_policy_config_defender_disablecatchupfullscan_0\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "DisableCatchUpFullScan_Disabled",
                  "displayName": "Disabled"
                },
                {
                  "name": "DisableCatchUpFullScan_Enabled",
                  "displayName": "Enabled"
                }
              ],
              "displayName": "Disable Catchup Full Scan"
            },
            {
              "name": "disableCatchUpQuickScan",
              "value": "[\"device_vendor_msft_policy_config_defender_disablecatchupquickscan_0\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "DisableCatchUpQuickScan_Disabled",
                  "displayName": "Disabled"
                },
                {
                  "name": "DisableCatchUpQuickScan_Enabled",
                  "displayName": "Enabled"
                }
              ],
              "displayName": "Disable Catchup Quick Scan"
            },
            {
              "name": "allowUserUIAccess",
              "value": "[\"device_vendor_msft_policy_config_defender_allowuseruiaccess_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "AllowUserUIAccess_NotAllowed",
                  "displayName": "Not allowed. Prevents users from accessing UI."
                },
                {
                  "name": "AllowUserUIAccess_Allowed",
                  "displayName": "Allowed. Lets users access UI."
                }
              ],
              "displayName": "Allow User UI Access"
            },
            {
              "name": "allowCloudProtection",
              "value": "[\"device_vendor_msft_policy_config_defender_allowcloudprotection_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "AllowCloudProtection_NotAllowed",
                  "displayName": "Not allowed. Turns off the Microsoft Active Protection Service."
                },
                {
                  "name": "AllowCloudProtection_Allowed",
                  "displayName": "Allowed. Turns on the Microsoft Active Protection Service."
                }
              ],
              "displayName": "Allow Cloud Protection"
            },
            {
              "name": "realTimeScanDirection",
              "value": "[\"device_vendor_msft_policy_config_defender_realtimescandirection_0\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "RealTimeScanDirection_MonitorAllFiles",
                  "displayName": "Monitor all files (bi-directional)."
                },
                {
                  "name": "RealTimeScanDirection_MonitorIncomingFiles",
                  "displayName": "Monitor incoming files."
                },
                {
                  "name": "RealTimeScanDirection_MonitorOutgoingFiles",
                  "displayName": "Monitor outgoing files."
                }
              ],
              "displayName": "Real Time Scan Direction"
            },
            {
              "name": "allowBehaviorMonitoring",
              "value": "[\"device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "AllowBehaviorMonitoring_NotAllowed",
                  "displayName": "Not allowed. Turns off behavior monitoring."
                },
                {
                  "name": "AllowBehaviorMonitoring_Allowed",
                  "displayName": "Allowed. Turns on real-time behavior monitoring."
                }
              ],
              "displayName": "Allow Behavior Monitoring"
            },
            {
              "name": "allowIOAVProtection",
              "value": "[\"device_vendor_msft_policy_config_defender_allowioavprotection_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "AllowIOAVProtection_NotAllowed",
                  "displayName": "Not allowed."
                },
                {
                  "name": "AllowIOAVProtection_Allowed",
                  "displayName": "Allowed."
                }
              ],
              "displayName": "Allow scanning of all downloaded files and attachments"
            },
            {
              "name": "allowScriptScanning",
              "value": "[\"device_vendor_msft_policy_config_defender_allowscriptscanning_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "AllowScriptScanning_NotAllowed",
                  "displayName": "Not allowed."
                },
                {
                  "name": "AllowScriptScanning_Allowed",
                  "displayName": "Allowed."
                }
              ],
              "displayName": "Allow Script Scanning"
            },
            {
              "name": "allowScanningNetworkFiles",
              "value": "[\"device_vendor_msft_policy_config_defender_allowscanningnetworkfiles_0\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "AllowScanningNetworkFiles_NotAllowed",
                  "displayName": "Not allowed. Turns off scanning of network files."
                },
                {
                  "name": "AllowScanningNetworkFiles_Allowed",
                  "displayName": "Allowed. Scans network files."
                }
              ],
              "displayName": "Allow Scanning Network Files"
            },
            {
              "name": "allowEmailScanning",
              "value": "[\"device_vendor_msft_policy_config_defender_allowemailscanning_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "AllowEmailScanning_NotAllowed",
                  "displayName": "Not allowed. Turns off email scanning."
                },
                {
                  "name": "AllowEmailScanning_Allowed",
                  "displayName": "Allowed. Turns on email scanning."
                }
              ],
              "displayName": "Allow Email Scanning"
            },
            {
              "name": "submitSamplesConsent",
              "value": "[\"device_vendor_msft_policy_config_defender_submitsamplesconsent_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "SubmitSamplesConsent_AlwaysPrompt",
                  "displayName": "Always prompt."
                },
                {
                  "name": "SubmitSamplesConsent_SendSafeSamples",
                  "displayName": "Send safe samples automatically."
                },
                {
                  "name": "SubmitSamplesConsent_NeverSend",
                  "displayName": "Never send."
                },
                {
                  "name": "SubmitSamplesConsent_SendAllSamples",
                  "displayName": "Send all samples automatically."
                }
              ],
              "displayName": "Submit Samples Consent"
            },
            {
              "name": "allowFullScanOnMappedNetworkDrives",
              "value": "[\"device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives_0\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "AllowFullScanOnMappedNetworkDrives_NotAllowed",
                  "displayName": "Not allowed. Disables scanning on mapped network drives."
                },
                {
                  "name": "AllowFullScanOnMappedNetworkDrives_Allowed",
                  "displayName": "Allowed. Scans mapped network drives."
                }
              ],
              "displayName": "Allow Full Scan On Mapped Network Drives"
            },
            {
              "name": "allowFullScanRemovableDriveScanning",
              "value": "[\"device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "AllowFullScanRemovableDriveScanning_NotAllowed",
                  "displayName": "Not allowed. Turns off scanning on removable drives."
                },
                {
                  "name": "AllowFullScanRemovableDriveScanning_Allowed",
                  "displayName": "Allowed. Scans removable drives."
                }
              ],
              "displayName": "Allow Full Scan Removable Drive Scanning"
            },
            {
              "name": "checkForSignaturesBeforeRunningScan",
              "value": "[\"device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "CheckForSignaturesBeforeRunningScan_Disabled",
                  "displayName": "Disabled"
                },
                {
                  "name": "CheckForSignaturesBeforeRunningScan_Enabled",
                  "displayName": "Enabled"
                }
              ],
              "displayName": "Check For Signatures Before Running Scan"
            },
            {
              "name": "cloudExtendedTimeout",
              "value": "50",
              "isRequired": true,
              "isReadOnly": true,
              "displayName": "Cloud Extended Timeout"
            },
            {
              "name": "scheduleQuickScanTime",
              "value": "720",
              "isRequired": true,
              "isReadOnly": true,
              "displayName": "Schedule Quick Scan Time"
            },
            {
              "name": "avgCPULoadFactor",
              "value": "50",
              "isRequired": true,
              "isReadOnly": true,
              "displayName": "Avg CPU Load Factor"
            },
            {
              "name": "daysToRetainCleanedMalware",
              "value": "0",
              "isRequired": true,
              "isReadOnly": true,
              "displayName": "Days To Retain Cleaned Malware"
            },
            {
              "name": "signatureUpdateInterval",
              "value": "4",
              "isRequired": true,
              "isReadOnly": true,
              "displayName": "Signature Update Interval"
            },
            {
              "name": "excludedExtensions",
              "value": "",
              "isRequired": false,
              "isReadOnly": false,
              "displayName": "Excluded Extensions (Enter comma-separated values)"
            },
            {
              "name": "excludedPaths",
              "value": "",
              "isRequired": false,
              "isReadOnly": false,
              "displayName": "Excluded Paths (Enter comma-separated values)"
            },
            {
              "name": "excludedProcesses",
              "value": "",
              "isRequired": false,
              "isReadOnly": false,
              "displayName": "Excluded Processes (Enter comma-separated values)"
            },
            {
              "name": "includeGroups",
              "value": "[\"All\"]",
              "isRequired": true,
              "isReadOnly": false,
              "referenceStrings": [
                {
                  "name": "Groups_AllGroups",
                  "displayName": "All groups"
                }
              ],
              "displayName": "Include groups"
            },
            {
              "name": "excludeGroups",
              "isRequired": false,
              "isReadOnly": false,
              "displayName": "Exclude groups"
            }
          ],
          "deploymentAction": {
            "operationDefinition": {
              "values": [
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '[@name()]' and technologies eq 'mdm,microsoftSense' and platforms eq 'windows10'],\"id\")],\"policyId\")",
                "{IncludeResponseBodyInException:true} PUT /beta/deviceManagement/configurationPolicies/[@sys.read(\"policyId\")] \\ {   \"name\": \"[@name()]\",\r\n                \"platforms\": \"windows10\",\r\n                \"roleScopeTagIds\": [[\r\n                  \"0\"\r\n                ]],\r\n                \"technologies\": \"mdm,microsoftSense\",\r\n                \"templateReference\": {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference\",\r\n                  \"templateId\": \"[@sys.project([\"{IncludeResponseBodyInException:true}\" GET /beta/deviceManagement/configurationPolicyTemplates?$filter=baseId eq '804339ad-1553-4478-a742-138fb5807418'&$orderby=version desc&$top=1],\"id\")]\"\r\n                },\r\n                \"settings\": \r\n                [[\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_puaprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@pUAProtection()])], \r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"2d790211-18cb-4e32-b8cc-97407e2c0b45\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"c0135c2a-f802-44f4-9b71-b0b976411b8c\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_cloudblocklevel\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@cloudBlockLevel()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"517b4e84-e933-42b9-b92f-00e640b1a82d\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"c7a37009-c16e-4145-84c8-89a8c121fb15\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_cloudextendedtimeout\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@cloudExtendedTimeout()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"608f1561-b603-46bd-bf5f-0b9872002f75\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f61c2788-14e4-4e80-a5a7-bf2ff5052f63\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_enablenetworkprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@enableNetworkProtection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"ee58fb51-9ae5-408b-9406-b92b643f388a\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f53ab20e-8af6-48f5-9fa1-46863e1e517e\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowrealtimemonitoring\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowRealtimeMonitoring()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"0492c452-1069-4b91-9363-93b8e006ab12\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f0790e28-9231-4d37-8f44-84bb47ca1b3e\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_schedulescanday\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@scheduleScanDay()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"7f4d9dda-6d48-4353-90ca-9fa7164c7215\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"087d3362-7e78-4983-96bc-1f4ea183f0e4\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_schedulequickscantime\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@scheduleQuickScanTime()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"5d5c55c8-1a4e-4272-830d-8dc64cd3ac03\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"784a4af1-33fa-45f2-b945-138b7ff3bcb6\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_scanparameter\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@scanParameter()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"70c8f42e-ee6a-4ef1-a070-cb0e9d472581\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"27ca2652-46f3-4cc7-83f2-bf85ff722d84\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowarchivescanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowArchiveScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"7c5c9cde-f74d-4d11-904f-de4c27f72d89\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_enablelowcpupriority\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@enableLowCPUPriority()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"045a4a13-deee-4e24-9fe4-985c9357680d\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"cdeb96cf-18f5-4477-a710-0ea9ecc618af\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_disablecatchupfullscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@disableCatchUpFullScan()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"1b26092f-48c4-447b-99d4-e9c501542f1c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f881b08c-f047-40d2-b7d9-3dde7ce9ef64\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_disablecatchupquickscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@disableCatchUpQuickScan()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"d263ced7-0d23-4095-9326-99c8b3f5d35b\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"dabf6781-9d5d-42da-822a-d4327aa2bdd1\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_avgcpuloadfactor\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@avgCPULoadFactor()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"37195fb1-3743-4c8e-a0ce-b6fae6fa3acd\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"816cc03e-8f96-4cba-b14f-2658d031a79a\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowuseruiaccess\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowUserUIAccess()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"4b6c9739-4449-4006-8e5f-3049136470ea\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"0170a900-b0bc-4ccc-b7ce-dda9be49189b\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowcloudprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowCloudProtection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"16fe8afd-67be-4c50-8619-d535451a500c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"7da139f1-9b7e-407d-853a-c2e5037cdc70\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_realtimescandirection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@realTimeScanDirection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"6b4e3497-cfbb-4761-a152-de935bbf3f07\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f5ff00a4-e5c7-44cf-a650-9c7619ff1561\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowbehaviormonitoring\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowBehaviorMonitoring()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"905921da-95e2-4a10-9e30-fe5540002ce1\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"8eef615a-1aa0-46f4-a25a-12cbe65de5ab\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowioavprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowIOAVProtection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"df4e6cbd-f7ff-41c8-88cd-fa25264a237e\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"fa06231d-aed4-4601-b631-3a37e85b62a0\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowscriptscanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowScriptScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"ab9e4320-c953-4067-ac9a-be2becd06b4a\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"000cf176-949c-4c08-a5d4-90ed43718db7\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowscanningnetworkfiles\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowScanningNetworkFiles()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"7b8c858c-a17d-4623-9e20-f34b851670ce\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f8f28442-0a6b-4b52-b42c-d31d9687c1cf\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowemailscanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowEmailScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"fdf107fd-e13b-4507-9d8f-db4d93476af9\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"b0d9ee81-de6a-4750-86d7-9397961c9852\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_daystoretaincleanedmalware\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@daysToRetainCleanedMalware()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"214b6feb-c9b2-4a17-af54-d51c805473e4\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"6f6d741c-1186-42e2-b2f2-8582febcfd60\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_submitsamplesconsent\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@submitSamplesConsent()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"826ed4b6-e04f-4975-9d23-6f0904b0d87e\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"bc47ce7d-a251-4cae-a8a2-6e8384904ab7\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowFullScanOnMappedNetworkDrives()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"3e920b10-3773-4ac5-957e-e5573aec6d04\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"dac47505-f072-48d6-9f23-8d93262d58ed\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowFullScanRemovableDriveScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"366c5727-629b-4a81-b50b-52f90282fa2c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"fb36e70b-5bc9-488a-a949-8ea3ac1634d5\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@checkForSignaturesBeforeRunningScan()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"010779d1-edd4-441d-8034-89ad57a863fe\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"4fea56e3-7bb6-4ad3-88c6-e364dd2f97b9\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_signatureupdateinterval\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@signatureUpdateInterval()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"0af6bbed-a74a-4d08-8587-b16b10b774cb\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"89879f27-6b7d-44d4-a08e-0a0de3e9663d\"\r\n                      }\r\n                    }\r\n                  }[@getExcludedExtensionsJSON([@sys.getSettingCollectionValue([@excludedExtensions()])])][@getExcludedPathsJSON([@sys.getSettingCollectionValue([@excludedPaths()])])][@getExcludedProcessesJSON([@sys.getSettingCollectionValue([@excludedProcesses()])])] ]]}",
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /[@sys.notexists(\"policyId\")]beta/deviceManagement/configurationPolicies?$filter=name eq '[@name()]' and technologies eq 'mdm' and platforms eq 'windows10'],\"id\")],\"oldPolicyId\")",
                "{IncludeResponseBodyInException:true} DELETE /beta/deviceManagement/configurationPolicies/[@sys.read(\"oldPolicyId\")]",
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} POST /beta/deviceManagement/configurationPolicies[@sys.notexists(\"policyId\")] \\ {   \"name\": \"[@name()]\",\r\n                \"platforms\": \"windows10\",\r\n                \"roleScopeTagIds\": [[\r\n                  \"0\"\r\n                ]],\r\n                \"technologies\": \"mdm,microsoftSense\",\r\n                \"templateReference\": {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference\",\r\n                  \"templateId\": \"[@sys.project([\"{IncludeResponseBodyInException:true}\" GET /beta/deviceManagement/configurationPolicyTemplates?$filter=baseId eq '804339ad-1553-4478-a742-138fb5807418'&$orderby=version desc&$top=1],\"id\")]\"\r\n                },\r\n                \"settings\": \r\n                [[\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_puaprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@pUAProtection()])], \r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"2d790211-18cb-4e32-b8cc-97407e2c0b45\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"c0135c2a-f802-44f4-9b71-b0b976411b8c\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_cloudblocklevel\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@cloudBlockLevel()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"517b4e84-e933-42b9-b92f-00e640b1a82d\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"c7a37009-c16e-4145-84c8-89a8c121fb15\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_cloudextendedtimeout\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@cloudExtendedTimeout()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"608f1561-b603-46bd-bf5f-0b9872002f75\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f61c2788-14e4-4e80-a5a7-bf2ff5052f63\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_enablenetworkprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@enableNetworkProtection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"ee58fb51-9ae5-408b-9406-b92b643f388a\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f53ab20e-8af6-48f5-9fa1-46863e1e517e\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowrealtimemonitoring\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowRealtimeMonitoring()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"0492c452-1069-4b91-9363-93b8e006ab12\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f0790e28-9231-4d37-8f44-84bb47ca1b3e\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_schedulescanday\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@scheduleScanDay()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"7f4d9dda-6d48-4353-90ca-9fa7164c7215\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"087d3362-7e78-4983-96bc-1f4ea183f0e4\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_schedulequickscantime\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@scheduleQuickScanTime()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"5d5c55c8-1a4e-4272-830d-8dc64cd3ac03\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"784a4af1-33fa-45f2-b945-138b7ff3bcb6\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_scanparameter\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@scanParameter()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"70c8f42e-ee6a-4ef1-a070-cb0e9d472581\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"27ca2652-46f3-4cc7-83f2-bf85ff722d84\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowarchivescanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowArchiveScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"7c5c9cde-f74d-4d11-904f-de4c27f72d89\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_enablelowcpupriority\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@enableLowCPUPriority()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"045a4a13-deee-4e24-9fe4-985c9357680d\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"cdeb96cf-18f5-4477-a710-0ea9ecc618af\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_disablecatchupfullscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@disableCatchUpFullScan()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"1b26092f-48c4-447b-99d4-e9c501542f1c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f881b08c-f047-40d2-b7d9-3dde7ce9ef64\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_disablecatchupquickscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@disableCatchUpQuickScan()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"d263ced7-0d23-4095-9326-99c8b3f5d35b\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"dabf6781-9d5d-42da-822a-d4327aa2bdd1\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_avgcpuloadfactor\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@avgCPULoadFactor()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"37195fb1-3743-4c8e-a0ce-b6fae6fa3acd\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"816cc03e-8f96-4cba-b14f-2658d031a79a\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowuseruiaccess\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowUserUIAccess()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"4b6c9739-4449-4006-8e5f-3049136470ea\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"0170a900-b0bc-4ccc-b7ce-dda9be49189b\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowcloudprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowCloudProtection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"16fe8afd-67be-4c50-8619-d535451a500c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"7da139f1-9b7e-407d-853a-c2e5037cdc70\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_realtimescandirection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@realTimeScanDirection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"6b4e3497-cfbb-4761-a152-de935bbf3f07\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f5ff00a4-e5c7-44cf-a650-9c7619ff1561\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowbehaviormonitoring\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowBehaviorMonitoring()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"905921da-95e2-4a10-9e30-fe5540002ce1\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"8eef615a-1aa0-46f4-a25a-12cbe65de5ab\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowioavprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowIOAVProtection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"df4e6cbd-f7ff-41c8-88cd-fa25264a237e\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"fa06231d-aed4-4601-b631-3a37e85b62a0\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowscriptscanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowScriptScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"ab9e4320-c953-4067-ac9a-be2becd06b4a\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"000cf176-949c-4c08-a5d4-90ed43718db7\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowscanningnetworkfiles\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowScanningNetworkFiles()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"7b8c858c-a17d-4623-9e20-f34b851670ce\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f8f28442-0a6b-4b52-b42c-d31d9687c1cf\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowemailscanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowEmailScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"fdf107fd-e13b-4507-9d8f-db4d93476af9\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"b0d9ee81-de6a-4750-86d7-9397961c9852\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_daystoretaincleanedmalware\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@daysToRetainCleanedMalware()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"214b6feb-c9b2-4a17-af54-d51c805473e4\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"6f6d741c-1186-42e2-b2f2-8582febcfd60\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_submitsamplesconsent\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@submitSamplesConsent()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"826ed4b6-e04f-4975-9d23-6f0904b0d87e\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"bc47ce7d-a251-4cae-a8a2-6e8384904ab7\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowFullScanOnMappedNetworkDrives()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"3e920b10-3773-4ac5-957e-e5573aec6d04\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"dac47505-f072-48d6-9f23-8d93262d58ed\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowFullScanRemovableDriveScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"366c5727-629b-4a81-b50b-52f90282fa2c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"fb36e70b-5bc9-488a-a949-8ea3ac1634d5\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@checkForSignaturesBeforeRunningScan()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"010779d1-edd4-441d-8034-89ad57a863fe\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"4fea56e3-7bb6-4ad3-88c6-e364dd2f97b9\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_signatureupdateinterval\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@signatureUpdateInterval()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"0af6bbed-a74a-4d08-8587-b16b10b774cb\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"89879f27-6b7d-44d4-a08e-0a0de3e9663d\"\r\n                      }\r\n                    }\r\n                  }[@getExcludedExtensionsJSON([@sys.getSettingCollectionValue([@excludedExtensions()])])][@getExcludedPathsJSON([@sys.getSettingCollectionValue([@excludedPaths()])])][@getExcludedProcessesJSON([@sys.getSettingCollectionValue([@excludedProcesses()])])] ]]}],\"id\")],\"policyId\")",
                "{IncludeResponseBodyInException:true} POST /beta/deviceManagement/configurationPolicies/[@sys.read(\"policyId\")]/assign \\ {\r\n            \"assignments\":\r\n            [[\r\n                [@sys.join([@sys.concat([@getIncludeGroups([@sys.jsonArrayParse([@includeGroups()])])],[@getExcludeGroups([@sys.jsonArrayParse([@excludeGroups()])])])])]\r\n            ]]\r\n        }",
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '[@name()]' and technologies eq 'mdm,microsoftSense' and platforms eq 'windows10'],\"id\")],\"policyId\")",
                "@sys.read(\"policyId\")"
              ],
              "lambdaDefinitions": [
                {
                  "type": 0,
                  "id": "getIncludeGroups",
                  "value": "select case\r\n\t                when data = 'All' then '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.allLicensedUsersAssignmentTarget\"\r\n\t\t                }\r\n\t                }'\r\n\t                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.groupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludeGroups",
                  "value": "select case\r\n                when data = '' then ''\r\n                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.exclusionGroupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedExtensionsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedextensions\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"634df7cc-28ae-438c-81b7-65f2f8ec0c63\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedPathsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedpaths\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"867f7498-1484-443f-bf6a-f12abb1f2f60\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedProcessesJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedprocesses\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"6b54c69b-1686-4088-95bb-62c19817e132\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "name",
                  "value": "select 'M365 Lighthouse - Setup Microsoft Defender Antivirus Policy for Windows 10 devices'"
                },
                {
                  "type": 0,
                  "id": "pUAProtection",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_puaprotection_1\"]'"
                },
                {
                  "type": 0,
                  "id": "cloudBlockLevel",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_cloudblocklevel_2\"]'"
                },
                {
                  "type": 0,
                  "id": "enableNetworkProtection",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_enablenetworkprotection_1\"]'"
                },
                {
                  "type": 0,
                  "id": "allowRealtimeMonitoring",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1\"]'"
                },
                {
                  "type": 0,
                  "id": "scheduleScanDay",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_schedulescanday_2\"]'"
                },
                {
                  "type": 0,
                  "id": "scanParameter",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_scanparameter_1\"]'"
                },
                {
                  "type": 0,
                  "id": "allowArchiveScanning",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_allowarchivescanning_1\"]'"
                },
                {
                  "type": 0,
                  "id": "enableLowCPUPriority",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_enablelowcpupriority_0\"]'"
                },
                {
                  "type": 0,
                  "id": "disableCatchUpFullScan",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_disablecatchupfullscan_0\"]'"
                },
                {
                  "type": 0,
                  "id": "disableCatchUpQuickScan",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_disablecatchupquickscan_0\"]'"
                },
                {
                  "type": 0,
                  "id": "allowUserUIAccess",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_allowuseruiaccess_1\"]'"
                },
                {
                  "type": 0,
                  "id": "allowCloudProtection",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_allowcloudprotection_1\"]'"
                },
                {
                  "type": 0,
                  "id": "realTimeScanDirection",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_realtimescandirection_0\"]'"
                },
                {
                  "type": 0,
                  "id": "allowBehaviorMonitoring",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1\"]'"
                },
                {
                  "type": 0,
                  "id": "allowIOAVProtection",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_allowioavprotection_1\"]'"
                },
                {
                  "type": 0,
                  "id": "allowScriptScanning",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_allowscriptscanning_1\"]'"
                },
                {
                  "type": 0,
                  "id": "allowScanningNetworkFiles",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_allowscanningnetworkfiles_0\"]'"
                },
                {
                  "type": 0,
                  "id": "allowEmailScanning",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_allowemailscanning_0\"]'"
                },
                {
                  "type": 0,
                  "id": "submitSamplesConsent",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_submitsamplesconsent_1\"]'"
                },
                {
                  "type": 0,
                  "id": "allowFullScanOnMappedNetworkDrives",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives_0\"]'"
                },
                {
                  "type": 0,
                  "id": "allowFullScanRemovableDriveScanning",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1\"]'"
                },
                {
                  "type": 0,
                  "id": "checkForSignaturesBeforeRunningScan",
                  "value": "select '[\"device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_1\"]'"
                },
                {
                  "type": 0,
                  "id": "cloudExtendedTimeout",
                  "value": "select '50'"
                },
                {
                  "type": 0,
                  "id": "scheduleQuickScanTime",
                  "value": "select '720'"
                },
                {
                  "type": 0,
                  "id": "avgCPULoadFactor",
                  "value": "select '50'"
                },
                {
                  "type": 0,
                  "id": "daysToRetainCleanedMalware",
                  "value": "select '0'"
                },
                {
                  "type": 0,
                  "id": "signatureUpdateInterval",
                  "value": "select '4'"
                },
                {
                  "type": 0,
                  "id": "excludedExtensions",
                  "value": "select ''"
                },
                {
                  "type": 0,
                  "id": "excludedPaths",
                  "value": "select ''"
                },
                {
                  "type": 0,
                  "id": "excludedProcesses",
                  "value": "select ''"
                },
                {
                  "type": 0,
                  "id": "includeGroups",
                  "value": "select '[\"All\"]'"
                },
                {
                  "type": 0,
                  "id": "excludeGroups",
                  "value": "select ''"
                },
                {
                  "type": 0,
                  "id": "tenantIds",
                  "value": "select '[\"a380a655-8cdd-4484-9eaf-7c9f320a122a\"]'"
                }
              ],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "aggregationDefinition": {
              "values": [
                "@sys.append([/result])"
              ],
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            }
          },
          "validationAction": {
            "operationDefinition": {
              "values": [
                "@sys.write([@sys.validateUserCount([{IncludeResponseBodyInException:true,ConsistencyLevelHeader:\"eventual\"} /v1.0/users/$count])],\"userCount\")",
                "@sys.write([@sys.normalize([{IncludeResponseBodyInException:true} /beta/deviceManagement/configurationPolicies?$expand=assignments])],\"policies\")",
                "@sys.write([@sys.normalize([{IncludeResponseBodyInException:true} /v1.0/users?$select=id,displayName,userPrincipalName,assignedPlans,assignedLicenses,userType&$expand=memberOf($select=roleTemplateId)[@sys.exists(\"userCount\")] ])],\"allUsers\")",
                "@sys.validateDeviceConfigurationPolicy([POST /echo \\ {   \"name\": \"[@name()]\",\r\n                \"platforms\": \"windows10\",\r\n                \"roleScopeTagIds\": [[\r\n                  \"0\"\r\n                ]],\r\n                \"technologies\": \"mdm,microsoftSense\",\r\n                \"templateReference\": {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference\",\r\n                  \"templateId\": \"[@sys.project([\"{IncludeResponseBodyInException:true}\" GET /beta/deviceManagement/configurationPolicyTemplates?$filter=baseId eq '804339ad-1553-4478-a742-138fb5807418'&$orderby=version desc&$top=1],\"id\")]\"\r\n                },\r\n                \"settings\": \r\n                [[\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_puaprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@pUAProtection()])], \r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"2d790211-18cb-4e32-b8cc-97407e2c0b45\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"c0135c2a-f802-44f4-9b71-b0b976411b8c\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_cloudblocklevel\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@cloudBlockLevel()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"517b4e84-e933-42b9-b92f-00e640b1a82d\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"c7a37009-c16e-4145-84c8-89a8c121fb15\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_cloudextendedtimeout\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@cloudExtendedTimeout()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"608f1561-b603-46bd-bf5f-0b9872002f75\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f61c2788-14e4-4e80-a5a7-bf2ff5052f63\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_enablenetworkprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@enableNetworkProtection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"ee58fb51-9ae5-408b-9406-b92b643f388a\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f53ab20e-8af6-48f5-9fa1-46863e1e517e\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowrealtimemonitoring\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowRealtimeMonitoring()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"0492c452-1069-4b91-9363-93b8e006ab12\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f0790e28-9231-4d37-8f44-84bb47ca1b3e\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_schedulescanday\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@scheduleScanDay()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"7f4d9dda-6d48-4353-90ca-9fa7164c7215\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"087d3362-7e78-4983-96bc-1f4ea183f0e4\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_schedulequickscantime\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@scheduleQuickScanTime()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"5d5c55c8-1a4e-4272-830d-8dc64cd3ac03\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"784a4af1-33fa-45f2-b945-138b7ff3bcb6\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_scanparameter\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@scanParameter()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"70c8f42e-ee6a-4ef1-a070-cb0e9d472581\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"27ca2652-46f3-4cc7-83f2-bf85ff722d84\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowarchivescanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowArchiveScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"7c5c9cde-f74d-4d11-904f-de4c27f72d89\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_enablelowcpupriority\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@enableLowCPUPriority()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"045a4a13-deee-4e24-9fe4-985c9357680d\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"cdeb96cf-18f5-4477-a710-0ea9ecc618af\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_disablecatchupfullscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@disableCatchUpFullScan()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"1b26092f-48c4-447b-99d4-e9c501542f1c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f881b08c-f047-40d2-b7d9-3dde7ce9ef64\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_disablecatchupquickscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@disableCatchUpQuickScan()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"d263ced7-0d23-4095-9326-99c8b3f5d35b\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"dabf6781-9d5d-42da-822a-d4327aa2bdd1\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_avgcpuloadfactor\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@avgCPULoadFactor()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"37195fb1-3743-4c8e-a0ce-b6fae6fa3acd\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"816cc03e-8f96-4cba-b14f-2658d031a79a\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowuseruiaccess\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowUserUIAccess()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"4b6c9739-4449-4006-8e5f-3049136470ea\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"0170a900-b0bc-4ccc-b7ce-dda9be49189b\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowcloudprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowCloudProtection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"16fe8afd-67be-4c50-8619-d535451a500c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"7da139f1-9b7e-407d-853a-c2e5037cdc70\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_realtimescandirection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@realTimeScanDirection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"6b4e3497-cfbb-4761-a152-de935bbf3f07\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f5ff00a4-e5c7-44cf-a650-9c7619ff1561\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowbehaviormonitoring\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowBehaviorMonitoring()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"905921da-95e2-4a10-9e30-fe5540002ce1\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"8eef615a-1aa0-46f4-a25a-12cbe65de5ab\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowioavprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowIOAVProtection()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"df4e6cbd-f7ff-41c8-88cd-fa25264a237e\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"fa06231d-aed4-4601-b631-3a37e85b62a0\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowscriptscanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowScriptScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"ab9e4320-c953-4067-ac9a-be2becd06b4a\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"000cf176-949c-4c08-a5d4-90ed43718db7\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowscanningnetworkfiles\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowScanningNetworkFiles()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"7b8c858c-a17d-4623-9e20-f34b851670ce\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f8f28442-0a6b-4b52-b42c-d31d9687c1cf\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowemailscanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowEmailScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"fdf107fd-e13b-4507-9d8f-db4d93476af9\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"b0d9ee81-de6a-4750-86d7-9397961c9852\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_daystoretaincleanedmalware\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@daysToRetainCleanedMalware()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"214b6feb-c9b2-4a17-af54-d51c805473e4\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"6f6d741c-1186-42e2-b2f2-8582febcfd60\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_submitsamplesconsent\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@submitSamplesConsent()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"826ed4b6-e04f-4975-9d23-6f0904b0d87e\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"bc47ce7d-a251-4cae-a8a2-6e8384904ab7\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowFullScanOnMappedNetworkDrives()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"3e920b10-3773-4ac5-957e-e5573aec6d04\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"dac47505-f072-48d6-9f23-8d93262d58ed\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@allowFullScanRemovableDriveScanning()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"366c5727-629b-4a81-b50b-52f90282fa2c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"fb36e70b-5bc9-488a-a949-8ea3ac1634d5\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([@checkForSignaturesBeforeRunningScan()])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"010779d1-edd4-441d-8034-89ad57a863fe\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"4fea56e3-7bb6-4ad3-88c6-e364dd2f97b9\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_signatureupdateinterval\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": [@signatureUpdateInterval()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"0af6bbed-a74a-4d08-8587-b16b10b774cb\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"89879f27-6b7d-44d4-a08e-0a0de3e9663d\"\r\n                      }\r\n                    }\r\n                  }[@getExcludedExtensionsJSON([@sys.getSettingCollectionValue([@excludedExtensions()])])][@getExcludedPathsJSON([@sys.getSettingCollectionValue([@excludedPaths()])])][@getExcludedProcessesJSON([@sys.getSettingCollectionValue([@excludedProcesses()])])] ]],\r\n            \"assignments\":\r\n            [[\r\n                [@sys.join([@sys.concat([@getIncludeGroups([@sys.jsonArrayParse([@includeGroups()])])],[@getExcludeGroups([@sys.jsonArrayParse([@excludeGroups()])])])])]\r\n            ]]\r\n        }],[@sys.read(\"policies\")],[@sys.read(\"allUsers\")])"
              ],
              "lambdaDefinitions": [
                {
                  "type": 0,
                  "id": "getIncludeGroups",
                  "value": "select case\r\n\t                when data = 'All' then '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.allLicensedUsersAssignmentTarget\"\r\n\t\t                }\r\n\t                }'\r\n\t                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.groupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludeGroups",
                  "value": "select case\r\n                when data = '' then ''\r\n                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.exclusionGroupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedExtensionsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedextensions\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"634df7cc-28ae-438c-81b7-65f2f8ec0c63\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedPathsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedpaths\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"867f7498-1484-443f-bf6a-f12abb1f2f60\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedProcessesJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedprocesses\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"6b54c69b-1686-4088-95bb-62c19817e132\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                }
              ],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "aggregationDefinition": {
              "values": [
                "@sys.append([/result])"
              ],
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "isAvailableOffline": true
          },
          "deletionAction": {
            "operationDefinition": {
              "values": [
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '[@name()]'],\"id\")],\"policyId\")",
                "{IncludeResponseBodyInException:true} DELETE /beta/deviceManagement/configurationPolicies/[@sys.read(\"policyId\")]"
              ],
              "lambdaDefinitions": [
                {
                  "type": 0,
                  "id": "getIncludeGroups",
                  "value": "select case\r\n\t                when data = 'All' then '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.allLicensedUsersAssignmentTarget\"\r\n\t\t                }\r\n\t                }'\r\n\t                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.groupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludeGroups",
                  "value": "select case\r\n                when data = '' then ''\r\n                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.exclusionGroupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedExtensionsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedextensions\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"634df7cc-28ae-438c-81b7-65f2f8ec0c63\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedPathsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedpaths\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"867f7498-1484-443f-bf6a-f12abb1f2f60\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedProcessesJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedprocesses\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"6b54c69b-1686-4088-95bb-62c19817e132\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                }
              ],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "aggregationDefinition": {
              "values": [
                "@sys.append([/result])"
              ],
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            }
          },
          "processedDeploymentAction": "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '' and technologies eq 'mdm,microsoftSense' and platforms eq 'windows10'],\"id\")],\"policyId\") EOC {IncludeResponseBodyInException:true} PUT /beta/deviceManagement/configurationPolicies/[@sys.read(\"policyId\")] \\ {   \"name\": \"\",\r\n                \"platforms\": \"windows10\",\r\n                \"roleScopeTagIds\": [[\r\n                  \"0\"\r\n                ]],\r\n                \"technologies\": \"mdm,microsoftSense\",\r\n                \"templateReference\": {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference\",\r\n                  \"templateId\": \"[@sys.project([\"{IncludeResponseBodyInException:true}\" GET /beta/deviceManagement/configurationPolicyTemplates?$filter=baseId eq '804339ad-1553-4478-a742-138fb5807418'&$orderby=version desc&$top=1],\"id\")]\"\r\n                },\r\n                \"settings\": \r\n                [[\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_puaprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_puaprotection_1\"])], \r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"2d790211-18cb-4e32-b8cc-97407e2c0b45\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"c0135c2a-f802-44f4-9b71-b0b976411b8c\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_cloudblocklevel\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_cloudblocklevel_2\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"517b4e84-e933-42b9-b92f-00e640b1a82d\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"c7a37009-c16e-4145-84c8-89a8c121fb15\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_cloudextendedtimeout\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": ,\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"608f1561-b603-46bd-bf5f-0b9872002f75\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f61c2788-14e4-4e80-a5a7-bf2ff5052f63\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_enablenetworkprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_enablenetworkprotection_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"ee58fb51-9ae5-408b-9406-b92b643f388a\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f53ab20e-8af6-48f5-9fa1-46863e1e517e\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowrealtimemonitoring\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"0492c452-1069-4b91-9363-93b8e006ab12\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f0790e28-9231-4d37-8f44-84bb47ca1b3e\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_schedulescanday\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"7f4d9dda-6d48-4353-90ca-9fa7164c7215\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"087d3362-7e78-4983-96bc-1f4ea183f0e4\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_schedulequickscantime\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": ,\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"5d5c55c8-1a4e-4272-830d-8dc64cd3ac03\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"784a4af1-33fa-45f2-b945-138b7ff3bcb6\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_scanparameter\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"70c8f42e-ee6a-4ef1-a070-cb0e9d472581\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"27ca2652-46f3-4cc7-83f2-bf85ff722d84\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowarchivescanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowarchivescanning_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"7c5c9cde-f74d-4d11-904f-de4c27f72d89\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_enablelowcpupriority\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_enablelowcpupriority_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"045a4a13-deee-4e24-9fe4-985c9357680d\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"cdeb96cf-18f5-4477-a710-0ea9ecc618af\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_disablecatchupfullscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_disablecatchupfullscan_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"1b26092f-48c4-447b-99d4-e9c501542f1c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f881b08c-f047-40d2-b7d9-3dde7ce9ef64\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_disablecatchupquickscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_disablecatchupquickscan_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"d263ced7-0d23-4095-9326-99c8b3f5d35b\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"dabf6781-9d5d-42da-822a-d4327aa2bdd1\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_avgcpuloadfactor\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": ,\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"37195fb1-3743-4c8e-a0ce-b6fae6fa3acd\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"816cc03e-8f96-4cba-b14f-2658d031a79a\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowuseruiaccess\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowuseruiaccess_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"4b6c9739-4449-4006-8e5f-3049136470ea\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"0170a900-b0bc-4ccc-b7ce-dda9be49189b\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowcloudprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowcloudprotection_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"16fe8afd-67be-4c50-8619-d535451a500c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"7da139f1-9b7e-407d-853a-c2e5037cdc70\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_realtimescandirection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_realtimescandirection_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"6b4e3497-cfbb-4761-a152-de935bbf3f07\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f5ff00a4-e5c7-44cf-a650-9c7619ff1561\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowbehaviormonitoring\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"905921da-95e2-4a10-9e30-fe5540002ce1\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"8eef615a-1aa0-46f4-a25a-12cbe65de5ab\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowioavprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowioavprotection_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"df4e6cbd-f7ff-41c8-88cd-fa25264a237e\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"fa06231d-aed4-4601-b631-3a37e85b62a0\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowscriptscanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowscriptscanning_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"ab9e4320-c953-4067-ac9a-be2becd06b4a\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"000cf176-949c-4c08-a5d4-90ed43718db7\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowscanningnetworkfiles\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowscanningnetworkfiles_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"7b8c858c-a17d-4623-9e20-f34b851670ce\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f8f28442-0a6b-4b52-b42c-d31d9687c1cf\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowemailscanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowemailscanning_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"fdf107fd-e13b-4507-9d8f-db4d93476af9\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"b0d9ee81-de6a-4750-86d7-9397961c9852\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_daystoretaincleanedmalware\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": ,\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"214b6feb-c9b2-4a17-af54-d51c805473e4\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"6f6d741c-1186-42e2-b2f2-8582febcfd60\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_submitsamplesconsent\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_submitsamplesconsent_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"826ed4b6-e04f-4975-9d23-6f0904b0d87e\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"bc47ce7d-a251-4cae-a8a2-6e8384904ab7\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"3e920b10-3773-4ac5-957e-e5573aec6d04\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"dac47505-f072-48d6-9f23-8d93262d58ed\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"366c5727-629b-4a81-b50b-52f90282fa2c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"fb36e70b-5bc9-488a-a949-8ea3ac1634d5\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"010779d1-edd4-441d-8034-89ad57a863fe\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"4fea56e3-7bb6-4ad3-88c6-e364dd2f97b9\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_signatureupdateinterval\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": ,\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"0af6bbed-a74a-4d08-8587-b16b10b774cb\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"89879f27-6b7d-44d4-a08e-0a0de3e9663d\"\r\n                      }\r\n                    }\r\n                  }[@getExcludedExtensionsJSON([@sys.getSettingCollectionValue()])][@getExcludedPathsJSON([@sys.getSettingCollectionValue()])][@getExcludedProcessesJSON([@sys.getSettingCollectionValue()])] ]]} EOC @sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /[@sys.notexists(\"policyId\")]beta/deviceManagement/configurationPolicies?$filter=name eq '' and technologies eq 'mdm' and platforms eq 'windows10'],\"id\")],\"oldPolicyId\") EOC {IncludeResponseBodyInException:true} DELETE /beta/deviceManagement/configurationPolicies/[@sys.read(\"oldPolicyId\")] EOC @sys.write([@sys.project([{IncludeResponseBodyInException:true} POST /beta/deviceManagement/configurationPolicies[@sys.notexists(\"policyId\")] \\ {   \"name\": \"\",\r\n                \"platforms\": \"windows10\",\r\n                \"roleScopeTagIds\": [[\r\n                  \"0\"\r\n                ]],\r\n                \"technologies\": \"mdm,microsoftSense\",\r\n                \"templateReference\": {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference\",\r\n                  \"templateId\": \"[@sys.project([\"{IncludeResponseBodyInException:true}\" GET /beta/deviceManagement/configurationPolicyTemplates?$filter=baseId eq '804339ad-1553-4478-a742-138fb5807418'&$orderby=version desc&$top=1],\"id\")]\"\r\n                },\r\n                \"settings\": \r\n                [[\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_puaprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_puaprotection_1\"])], \r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"2d790211-18cb-4e32-b8cc-97407e2c0b45\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"c0135c2a-f802-44f4-9b71-b0b976411b8c\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_cloudblocklevel\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_cloudblocklevel_2\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"517b4e84-e933-42b9-b92f-00e640b1a82d\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"c7a37009-c16e-4145-84c8-89a8c121fb15\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_cloudextendedtimeout\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": ,\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"608f1561-b603-46bd-bf5f-0b9872002f75\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f61c2788-14e4-4e80-a5a7-bf2ff5052f63\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_enablenetworkprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_enablenetworkprotection_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"ee58fb51-9ae5-408b-9406-b92b643f388a\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f53ab20e-8af6-48f5-9fa1-46863e1e517e\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowrealtimemonitoring\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"0492c452-1069-4b91-9363-93b8e006ab12\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f0790e28-9231-4d37-8f44-84bb47ca1b3e\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_schedulescanday\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"7f4d9dda-6d48-4353-90ca-9fa7164c7215\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"087d3362-7e78-4983-96bc-1f4ea183f0e4\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_schedulequickscantime\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": ,\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"5d5c55c8-1a4e-4272-830d-8dc64cd3ac03\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"784a4af1-33fa-45f2-b945-138b7ff3bcb6\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_scanparameter\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray()],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"70c8f42e-ee6a-4ef1-a070-cb0e9d472581\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"27ca2652-46f3-4cc7-83f2-bf85ff722d84\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowarchivescanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowarchivescanning_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"7c5c9cde-f74d-4d11-904f-de4c27f72d89\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_enablelowcpupriority\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_enablelowcpupriority_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"045a4a13-deee-4e24-9fe4-985c9357680d\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"cdeb96cf-18f5-4477-a710-0ea9ecc618af\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_disablecatchupfullscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_disablecatchupfullscan_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"1b26092f-48c4-447b-99d4-e9c501542f1c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f881b08c-f047-40d2-b7d9-3dde7ce9ef64\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_disablecatchupquickscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_disablecatchupquickscan_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"d263ced7-0d23-4095-9326-99c8b3f5d35b\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"dabf6781-9d5d-42da-822a-d4327aa2bdd1\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_avgcpuloadfactor\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": ,\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"37195fb1-3743-4c8e-a0ce-b6fae6fa3acd\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"816cc03e-8f96-4cba-b14f-2658d031a79a\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowuseruiaccess\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowuseruiaccess_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"4b6c9739-4449-4006-8e5f-3049136470ea\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"0170a900-b0bc-4ccc-b7ce-dda9be49189b\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowcloudprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowcloudprotection_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"16fe8afd-67be-4c50-8619-d535451a500c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"7da139f1-9b7e-407d-853a-c2e5037cdc70\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_realtimescandirection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_realtimescandirection_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"6b4e3497-cfbb-4761-a152-de935bbf3f07\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f5ff00a4-e5c7-44cf-a650-9c7619ff1561\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowbehaviormonitoring\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"905921da-95e2-4a10-9e30-fe5540002ce1\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"8eef615a-1aa0-46f4-a25a-12cbe65de5ab\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowioavprotection\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowioavprotection_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"df4e6cbd-f7ff-41c8-88cd-fa25264a237e\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"fa06231d-aed4-4601-b631-3a37e85b62a0\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowscriptscanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowscriptscanning_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"ab9e4320-c953-4067-ac9a-be2becd06b4a\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"000cf176-949c-4c08-a5d4-90ed43718db7\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowscanningnetworkfiles\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowscanningnetworkfiles_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"7b8c858c-a17d-4623-9e20-f34b851670ce\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"f8f28442-0a6b-4b52-b42c-d31d9687c1cf\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowemailscanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowemailscanning_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"fdf107fd-e13b-4507-9d8f-db4d93476af9\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"b0d9ee81-de6a-4750-86d7-9397961c9852\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_daystoretaincleanedmalware\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": ,\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"214b6feb-c9b2-4a17-af54-d51c805473e4\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"6f6d741c-1186-42e2-b2f2-8582febcfd60\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_submitsamplesconsent\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_submitsamplesconsent_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"826ed4b6-e04f-4975-9d23-6f0904b0d87e\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"bc47ce7d-a251-4cae-a8a2-6e8384904ab7\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives_0\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"3e920b10-3773-4ac5-957e-e5573aec6d04\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"dac47505-f072-48d6-9f23-8d93262d58ed\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"366c5727-629b-4a81-b50b-52f90282fa2c\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"fb36e70b-5bc9-488a-a949-8ea3ac1634d5\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan\",\r\n                      \"choiceSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                        \"value\": [@sys.trimArray([\"device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_1\"])],\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"010779d1-edd4-441d-8034-89ad57a863fe\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"4fea56e3-7bb6-4ad3-88c6-e364dd2f97b9\"\r\n                      }\r\n                    }\r\n                  },\r\n                  {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                    \"settingInstance\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n                      \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_signatureupdateinterval\",\r\n                      \"simpleSettingValue\": {\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationIntegerSettingValue\",\r\n                        \"value\": ,\r\n                        \"settingValueTemplateReference\": {\r\n                          \"settingValueTemplateId\": \"0af6bbed-a74a-4d08-8587-b16b10b774cb\"\r\n                        }\r\n                      },\r\n                      \"settingInstanceTemplateReference\": {\r\n                        \"settingInstanceTemplateId\": \"89879f27-6b7d-44d4-a08e-0a0de3e9663d\"\r\n                      }\r\n                    }\r\n                  }[@getExcludedExtensionsJSON([@sys.getSettingCollectionValue()])][@getExcludedPathsJSON([@sys.getSettingCollectionValue()])][@getExcludedProcessesJSON([@sys.getSettingCollectionValue()])] ]]}],\"id\")],\"policyId\") EOC {IncludeResponseBodyInException:true} POST /beta/deviceManagement/configurationPolicies/[@sys.read(\"policyId\")]/assign \\ {\r\n            \"assignments\":\r\n            [[\r\n                [@sys.join([@sys.concat([@getIncludeGroups([@sys.jsonArrayParse()])],[@getExcludeGroups([@sys.jsonArrayParse()])])])]\r\n            ]]\r\n        } EOC @sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '' and technologies eq 'mdm,microsoftSense' and platforms eq 'windows10'],\"id\")],\"policyId\") EOC @sys.read(\"policyId\") EOC @sys.append([/result]) EOC ",
          "subtaskCategory": 0,
          "requiredSkuRules": [
            {
              "requiredSkuFlags": 2
            }
          ],
          "dependentVersions": [],
          "id": "182521ce-7cfa-4ba9-816e-711a01c014cb"
        }
      ]
    }
  ]
}