{
  "CosmosDbEntity": "managementTemplate",
  "priority": 9,
  "category": 1,
  "provider": 0,
  "version": 0,
  "displayName": "Configure Microsoft Defender Firewall",
  "description": "Microsoft Defender Firewall helps secure users by determining which network traffic can be sent and received by their devices. Blocking unauthorized network traffic reduces the risk of network security threats and protects intellectual property.",
  "userImpact": "When Microsoft Defender Firewall is set up for your tenants, it helps prevent unauthorized incoming and outgoing traffic. It safeguards sensitive and intellectual property and reduces the risk of network security threats.",
  "informationLinks": [],
  "id": "49c339be-5e02-4241-88db-ef0f63a0af8b",
  "managementTemplateSteps": [
    {
      "CosmosDbEntity": "managementTemplateStep",
      "priority": 0,
      "category": 0,
      "isCloned": true,
      "displayName": "Configure a Microsoft Defender Firewall policy for Windows 10 and later",
      "description": "Microsoft Defender Firewall helps secure users by determining which network traffic can be sent and received by their devices. Blocking unauthorized network traffic reduces the risk of network security threats and protects intellectual property.",
      "portalLink": {
        "url": "https://endpoint.microsoft.com/{tenantName}/#blade/Microsoft_Intune_Workflows/SecurityManagementMenu/firewall",
        "displayName": "Microsoft Intune"
      },
      "userImpact": "When Microsoft Defender Firewall is set up for your tenants, it helps prevent unauthorized incoming and outgoing traffic. It safeguards sensitive and intellectual property and reduces the risk of network security threats.",
      "informationLinks": [
        {
          "url": "https://go.microsoft.com/fwlink/?linkid=2185945",
          "displayName": "Windows Defender Firewall with Advanced Security"
        }
      ],
      "id": "0b3662d1-12a1-4853-baa8-60fb4782c592",
      "versions": [
        {
          "CosmosDbEntity": "managementTemplateStepVersion",
          "name": "Firewall-1",
          "version": 1,
          "similarToDefaultBaselineTaskSetting": false,
          "matchingDefaultBaselineSubtaskId": "",
          "settings": [
            {
              "name": "name",
              "value": "M365 Lighthouse - Configure Windows Defender Firewall",
              "isRequired": true,
              "isReadOnly": true,
              "referenceStrings": [],
              "displayName": "Name"
            },
            {
              "name": "allowlocalipsecpolicymerge",
              "value": "true",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [],
              "displayName": "Allow Local Ipsec Policy Merge"
            },
            {
              "name": "allowlocalpolicymerge",
              "value": "true",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [],
              "displayName": "Allow Local Policy Merge"
            },
            {
              "name": "authappsallowuserprefmerge",
              "value": "true",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [],
              "displayName": "Auth Apps Allow User Pref Merge"
            },
            {
              "name": "defaultinboundaction",
              "value": "[\"1\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "BlueprintDetail_Generic_ActionSteps_Settings_Allowed",
                  "displayName": "Allowed"
                },
                {
                  "name": "BlueprintDetail_Generic_ActionSteps_Settings_Blocked",
                  "displayName": "Blocked"
                }
              ],
              "displayName": "Default Inbound Action for Private Profile"
            },
            {
              "name": "defaultoutboundaction",
              "value": "[\"0\"]",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [
                {
                  "name": "BlueprintDetail_Generic_ActionSteps_Settings_Allowed",
                  "displayName": "Allowed"
                },
                {
                  "name": "BlueprintDetail_Generic_ActionSteps_Settings_Blocked",
                  "displayName": "Blocked"
                }
              ],
              "displayName": "Default Outbound Action"
            },
            {
              "name": "disableinboundnotifications",
              "value": "false",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [],
              "displayName": "Disable Inbound Notifications"
            },
            {
              "name": "disablestealthmode",
              "value": "false",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [],
              "displayName": "Disable Stealth Mode"
            },
            {
              "name": "disablestealthmodeipsecsecuredpacketexemption",
              "value": "true",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [],
              "displayName": "Disable Stealth Mode Ipsec Secured Packet Exemption"
            },
            {
              "name": "disableunicastresponsestomulticastbroadcast",
              "value": "false",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [],
              "displayName": "Disable Unicast Responses To Multicast Broadcast"
            },
            {
              "name": "globalportsallowuserprefmerge",
              "value": "true",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [],
              "displayName": "Global Ports Allow User Pref Merge"
            },
            {
              "name": "shielded",
              "value": "false",
              "isRequired": true,
              "isReadOnly": true,
              "isRelevantForComparision": true,
              "referenceStrings": [],
              "displayName": "Shielded"
            },
            {
              "name": "includeGroups",
              "value": "[\"All\"]",
              "isRequired": true,
              "isReadOnly": false,
              "referenceStrings": [
                {
                  "name": "Groups_AllGroups",
                  "displayName": "All groups"
                }
              ],
              "displayName": "Include groups"
            },
            {
              "name": "excludeGroups",
              "isRequired": false,
              "isReadOnly": false,
              "referenceStrings": [],
              "displayName": "Exclude groups"
            }
          ],
          "deploymentAction": {
            "operationDefinition": {
              "values": [
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '[@name()]' and technologies eq 'mdm,microsoftSense' and platforms eq 'windows10'],\"id\")],\"policyId\")",
                "{IncludeResponseBodyInException:true} PUT /beta/deviceManagement/configurationPolicies/[@sys.read(\"policyId\")] \\ { \"name\": \"[@name()]\",\r\n              \"platforms\": \"windows10\",\r\n              \"roleScopeTagIds\": [[\r\n                  \"0\"\r\n              ]],\r\n              \"technologies\": \"mdm,microsoftSense\",\r\n              \"templateReference\": {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference\",\r\n                  \"templateId\": \"[@sys.project([\"{IncludeResponseBodyInException:true}\" GET /beta/deviceManagement/configurationPolicyTemplates?$filter=baseId eq '6078910e-d808-4a9f-a51d-1b8a7bacb7c0'&$orderby=version desc&$top=1],\"id\")]\"\r\n                },\r\n              \"settings\": [[\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_[@allowlocalipsecpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_[@allowlocalpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge_[@authappsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction_[@sys.first([@defaultinboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction_[@sys.first([@defaultoutboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_[@disableinboundnotifications()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_[@disablestealthmode()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_[@disablestealthmodeipsecsecuredpacketexemption()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_[@disableunicastresponsestomulticastbroadcast()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_[@globalportsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded_[@shielded()]\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"120c5dbe-0c88-46f0-b897-2c996d3e5277\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"7714c373-a19a-4b64-ba6d-2e9db04a7684\"\r\n                    }\r\n                  }\r\n                },\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_[@allowlocalipsecpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_[@allowlocalpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_[@authappsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_[@sys.first([@defaultinboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_[@sys.first([@defaultoutboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_[@disableinboundnotifications()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_[@disablestealthmode()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_[@disablestealthmodeipsecsecuredpacketexemption()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_[@disableunicastresponsestomulticastbroadcast()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_[@globalportsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded_[@shielded()]\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"9d55dfae-d55f-4f2a-af03-9a9524f61e76\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"1c14f914-69bb-49f8-af5b-e29173a6ee95\" \r\n                    }\r\n                  }\r\n                },\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_[@allowlocalipsecpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_[@allowlocalpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_[@authappsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_[@sys.first([@defaultinboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_[@sys.first([@defaultoutboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_[@disableinboundnotifications()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_[@disablestealthmode()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_[@disablestealthmodeipsecsecuredpacketexemption()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_[@disableunicastresponsestomulticastbroadcast()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_[@globalportsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded_[@shielded()]\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"c38694c7-51a4-4a35-8f64-b10866a04776\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"e2714734-708e-4286-8ae9-d56821e306a3\"\r\n                    }\r\n                  }\r\n                }\r\n              ]]}",
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /[@sys.notexists(\"policyId\")]beta/deviceManagement/configurationPolicies?$filter=name eq '[@name()]' and technologies eq 'mdm' and platforms eq 'windows10'],\"id\")],\"oldPolicyId\")",
                "{IncludeResponseBodyInException:true} DELETE /beta/deviceManagement/configurationPolicies/[@sys.read(\"oldPolicyId\")]",
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} POST /beta/deviceManagement/configurationPolicies[@sys.notexists(\"policyId\")] \\ { \"name\": \"[@name()]\",\r\n              \"platforms\": \"windows10\",\r\n              \"roleScopeTagIds\": [[\r\n                  \"0\"\r\n              ]],\r\n              \"technologies\": \"mdm,microsoftSense\",\r\n              \"templateReference\": {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference\",\r\n                  \"templateId\": \"[@sys.project([\"{IncludeResponseBodyInException:true}\" GET /beta/deviceManagement/configurationPolicyTemplates?$filter=baseId eq '6078910e-d808-4a9f-a51d-1b8a7bacb7c0'&$orderby=version desc&$top=1],\"id\")]\"\r\n                },\r\n              \"settings\": [[\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_[@allowlocalipsecpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_[@allowlocalpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge_[@authappsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction_[@sys.first([@defaultinboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction_[@sys.first([@defaultoutboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_[@disableinboundnotifications()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_[@disablestealthmode()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_[@disablestealthmodeipsecsecuredpacketexemption()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_[@disableunicastresponsestomulticastbroadcast()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_[@globalportsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded_[@shielded()]\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"120c5dbe-0c88-46f0-b897-2c996d3e5277\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"7714c373-a19a-4b64-ba6d-2e9db04a7684\"\r\n                    }\r\n                  }\r\n                },\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_[@allowlocalipsecpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_[@allowlocalpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_[@authappsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_[@sys.first([@defaultinboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_[@sys.first([@defaultoutboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_[@disableinboundnotifications()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_[@disablestealthmode()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_[@disablestealthmodeipsecsecuredpacketexemption()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_[@disableunicastresponsestomulticastbroadcast()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_[@globalportsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded_[@shielded()]\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"9d55dfae-d55f-4f2a-af03-9a9524f61e76\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"1c14f914-69bb-49f8-af5b-e29173a6ee95\" \r\n                    }\r\n                  }\r\n                },\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_[@allowlocalipsecpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_[@allowlocalpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_[@authappsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_[@sys.first([@defaultinboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_[@sys.first([@defaultoutboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_[@disableinboundnotifications()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_[@disablestealthmode()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_[@disablestealthmodeipsecsecuredpacketexemption()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_[@disableunicastresponsestomulticastbroadcast()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_[@globalportsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded_[@shielded()]\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"c38694c7-51a4-4a35-8f64-b10866a04776\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"e2714734-708e-4286-8ae9-d56821e306a3\"\r\n                    }\r\n                  }\r\n                }\r\n              ]]}],\"id\")],\"policyId\")",
                "{IncludeResponseBodyInException:true} POST /beta/deviceManagement/configurationPolicies/[@sys.read(\"policyId\")]/assign \\ {\r\n            \"assignments\":\r\n            [[\r\n                [@sys.join([@sys.concat([@getIncludeGroups([@sys.jsonArrayParse([@includeGroups()])])],[@getExcludeGroups([@sys.jsonArrayParse([@excludeGroups()])])])])]\r\n            ]]\r\n        }",
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '[@name()]' and technologies eq 'mdm,microsoftSense' and platforms eq 'windows10'],\"id\")],\"policyId\")",
                "@sys.read(\"policyId\")"
              ],
              "lambdaDefinitions": [
                {
                  "type": 0,
                  "id": "getIncludeGroups",
                  "value": "select case\r\n\t                when data = 'All' then '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.allLicensedUsersAssignmentTarget\"\r\n\t\t                }\r\n\t                }'\r\n\t                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.groupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludeGroups",
                  "value": "select case\r\n                when data = '' then ''\r\n                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.exclusionGroupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedExtensionsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedextensions\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"634df7cc-28ae-438c-81b7-65f2f8ec0c63\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedPathsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedpaths\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"867f7498-1484-443f-bf6a-f12abb1f2f60\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedProcessesJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedprocesses\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"6b54c69b-1686-4088-95bb-62c19817e132\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "name",
                  "value": "select 'M365 Lighthouse - Configure Windows Defender Firewall'"
                },
                {
                  "type": 0,
                  "id": "allowlocalipsecpolicymerge",
                  "value": "select 'true'"
                },
                {
                  "type": 0,
                  "id": "allowlocalpolicymerge",
                  "value": "select 'true'"
                },
                {
                  "type": 0,
                  "id": "authappsallowuserprefmerge",
                  "value": "select 'true'"
                },
                {
                  "type": 0,
                  "id": "defaultinboundaction",
                  "value": "select '[\"1\"]'"
                },
                {
                  "type": 0,
                  "id": "defaultoutboundaction",
                  "value": "select '[\"0\"]'"
                },
                {
                  "type": 0,
                  "id": "disableinboundnotifications",
                  "value": "select 'false'"
                },
                {
                  "type": 0,
                  "id": "disablestealthmode",
                  "value": "select 'false'"
                },
                {
                  "type": 0,
                  "id": "disablestealthmodeipsecsecuredpacketexemption",
                  "value": "select 'true'"
                },
                {
                  "type": 0,
                  "id": "disableunicastresponsestomulticastbroadcast",
                  "value": "select 'false'"
                },
                {
                  "type": 0,
                  "id": "globalportsallowuserprefmerge",
                  "value": "select 'true'"
                },
                {
                  "type": 0,
                  "id": "shielded",
                  "value": "select 'false'"
                },
                {
                  "type": 0,
                  "id": "includeGroups",
                  "value": "select '[\"All\"]'"
                },
                {
                  "type": 0,
                  "id": "excludeGroups",
                  "value": "select ''"
                },
                {
                  "type": 0,
                  "id": "tenantIds",
                  "value": "select '[\"a380a655-8cdd-4484-9eaf-7c9f320a122a\"]'"
                }
              ],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "aggregationDefinition": {
              "values": [
                "@sys.append([/result])"
              ],
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            }
          },
          "validationAction": {
            "operationDefinition": {
              "values": [
                "@sys.write([@sys.validateUserCount([{IncludeResponseBodyInException:true,ConsistencyLevelHeader:\"eventual\"} /v1.0/users/$count])],\"userCount\")",
                "@sys.write([@sys.normalize([{IncludeResponseBodyInException:true} /beta/deviceManagement/configurationPolicies?$expand=assignments])],\"policies\")",
                "@sys.write([@sys.normalize([{IncludeResponseBodyInException:true} /v1.0/users?$select=id,displayName,userPrincipalName,assignedPlans,assignedLicenses,userType&$expand=memberOf($select=roleTemplateId)[@sys.exists(\"userCount\")] ])],\"allUsers\")",
                "@sys.validateDeviceConfigurationPolicy([POST /echo \\ { \"name\": \"[@name()]\",\r\n              \"platforms\": \"windows10\",\r\n              \"roleScopeTagIds\": [[\r\n                  \"0\"\r\n              ]],\r\n              \"technologies\": \"mdm,microsoftSense\",\r\n              \"templateReference\": {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference\",\r\n                  \"templateId\": \"[@sys.project([\"{IncludeResponseBodyInException:true}\" GET /beta/deviceManagement/configurationPolicyTemplates?$filter=baseId eq '6078910e-d808-4a9f-a51d-1b8a7bacb7c0'&$orderby=version desc&$top=1],\"id\")]\"\r\n                },\r\n              \"settings\": [[\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_[@allowlocalipsecpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_[@allowlocalpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge_[@authappsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction_[@sys.first([@defaultinboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction_[@sys.first([@defaultoutboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_[@disableinboundnotifications()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_[@disablestealthmode()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_[@disablestealthmodeipsecsecuredpacketexemption()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_[@disableunicastresponsestomulticastbroadcast()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_[@globalportsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded_[@shielded()]\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"120c5dbe-0c88-46f0-b897-2c996d3e5277\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"7714c373-a19a-4b64-ba6d-2e9db04a7684\"\r\n                    }\r\n                  }\r\n                },\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_[@allowlocalipsecpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_[@allowlocalpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_[@authappsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_[@sys.first([@defaultinboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_[@sys.first([@defaultoutboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_[@disableinboundnotifications()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_[@disablestealthmode()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_[@disablestealthmodeipsecsecuredpacketexemption()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_[@disableunicastresponsestomulticastbroadcast()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_[@globalportsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded_[@shielded()]\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"9d55dfae-d55f-4f2a-af03-9a9524f61e76\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"1c14f914-69bb-49f8-af5b-e29173a6ee95\" \r\n                    }\r\n                  }\r\n                },\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_[@allowlocalipsecpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_[@allowlocalpolicymerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_[@authappsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_[@sys.first([@defaultinboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_[@sys.first([@defaultoutboundaction()])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_[@disableinboundnotifications()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_[@disablestealthmode()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_[@disablestealthmodeipsecsecuredpacketexemption()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_[@disableunicastresponsestomulticastbroadcast()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_[@globalportsallowuserprefmerge()]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded_[@shielded()]\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"c38694c7-51a4-4a35-8f64-b10866a04776\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"e2714734-708e-4286-8ae9-d56821e306a3\"\r\n                    }\r\n                  }\r\n                }\r\n              ]],\r\n            \"assignments\":\r\n            [[\r\n                [@sys.join([@sys.concat([@getIncludeGroups([@sys.jsonArrayParse([@includeGroups()])])],[@getExcludeGroups([@sys.jsonArrayParse([@excludeGroups()])])])])]\r\n            ]]\r\n        }],[@sys.read(\"policies\")],[@sys.read(\"allUsers\")])"
              ],
              "lambdaDefinitions": [
                {
                  "type": 0,
                  "id": "getIncludeGroups",
                  "value": "select case\r\n\t                when data = 'All' then '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.allLicensedUsersAssignmentTarget\"\r\n\t\t                }\r\n\t                }'\r\n\t                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.groupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludeGroups",
                  "value": "select case\r\n                when data = '' then ''\r\n                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.exclusionGroupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedExtensionsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedextensions\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"634df7cc-28ae-438c-81b7-65f2f8ec0c63\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedPathsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedpaths\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"867f7498-1484-443f-bf6a-f12abb1f2f60\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedProcessesJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedprocesses\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"6b54c69b-1686-4088-95bb-62c19817e132\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                }
              ],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "aggregationDefinition": {
              "values": [
                "@sys.append([/result])"
              ],
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "isAvailableOffline": true
          },
          "deletionAction": {
            "operationDefinition": {
              "values": [
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '[@name()]'],\"id\")],\"policyId\")",
                "{IncludeResponseBodyInException:true} DELETE /beta/deviceManagement/configurationPolicies/[@sys.read(\"policyId\")]"
              ],
              "lambdaDefinitions": [
                {
                  "type": 0,
                  "id": "getIncludeGroups",
                  "value": "select case\r\n\t                when data = 'All' then '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.allLicensedUsersAssignmentTarget\"\r\n\t\t                }\r\n\t                }'\r\n\t                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.groupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludeGroups",
                  "value": "select case\r\n                when data = '' then ''\r\n                else '{ \r\n\t\t                \"target\":\r\n                        {\r\n\t\t\t                \"@odata.type\": \"#microsoft.graph.exclusionGroupAssignmentTarget\",\r\n                            \"groupId\": \"' || data || '\"\r\n\t\t                }\r\n\t                }'\r\n                end\r\n                from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedExtensionsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedextensions\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"634df7cc-28ae-438c-81b7-65f2f8ec0c63\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedPathsJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedpaths\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"867f7498-1484-443f-bf6a-f12abb1f2f60\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludedProcessesJSON",
                  "value": "select case\r\n                    when data = '' or data IS NULL then ''\r\n                    else ',{\r\n                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                        \"settingInstance\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance\",\r\n                            \"settingDefinitionId\": \"device_vendor_msft_policy_config_defender_excludedprocesses\",\r\n                            \"settingInstanceTemplateReference\": {\r\n                                \"settingInstanceTemplateId\": \"6b54c69b-1686-4088-95bb-62c19817e132\"\r\n                            },\r\n                            \"simpleSettingCollectionValue\": [\r\n                                ' || data || '\r\n                            ]\r\n                            }\r\n                    }'\r\n                    end\r\n                    from arg0"
                }
              ],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "aggregationDefinition": {
              "values": [
                "@sys.append([/result])"
              ],
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            }
          },
          "processedDeploymentAction": "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '' and technologies eq 'mdm,microsoftSense' and platforms eq 'windows10'],\"id\")],\"policyId\") EOC {IncludeResponseBodyInException:true} PUT /beta/deviceManagement/configurationPolicies/[@sys.read(\"policyId\")] \\ { \"name\": \"\",\r\n              \"platforms\": \"windows10\",\r\n              \"roleScopeTagIds\": [[\r\n                  \"0\"\r\n              ]],\r\n              \"technologies\": \"mdm,microsoftSense\",\r\n              \"templateReference\": {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference\",\r\n                  \"templateId\": \"[@sys.project([\"{IncludeResponseBodyInException:true}\" GET /beta/deviceManagement/configurationPolicyTemplates?$filter=baseId eq '6078910e-d808-4a9f-a51d-1b8a7bacb7c0'&$orderby=version desc&$top=1],\"id\")]\"\r\n                },\r\n              \"settings\": [[\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction_[@sys.first([\"1\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction_[@sys.first([\"0\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded_false\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"120c5dbe-0c88-46f0-b897-2c996d3e5277\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"7714c373-a19a-4b64-ba6d-2e9db04a7684\"\r\n                    }\r\n                  }\r\n                },\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_[@sys.first([\"1\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_[@sys.first([\"0\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded_false\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"9d55dfae-d55f-4f2a-af03-9a9524f61e76\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"1c14f914-69bb-49f8-af5b-e29173a6ee95\" \r\n                    }\r\n                  }\r\n                },\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_[@sys.first([\"1\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_[@sys.first([\"0\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded_false\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"c38694c7-51a4-4a35-8f64-b10866a04776\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"e2714734-708e-4286-8ae9-d56821e306a3\"\r\n                    }\r\n                  }\r\n                }\r\n              ]]} EOC @sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /[@sys.notexists(\"policyId\")]beta/deviceManagement/configurationPolicies?$filter=name eq '' and technologies eq 'mdm' and platforms eq 'windows10'],\"id\")],\"oldPolicyId\") EOC {IncludeResponseBodyInException:true} DELETE /beta/deviceManagement/configurationPolicies/[@sys.read(\"oldPolicyId\")] EOC @sys.write([@sys.project([{IncludeResponseBodyInException:true} POST /beta/deviceManagement/configurationPolicies[@sys.notexists(\"policyId\")] \\ { \"name\": \"\",\r\n              \"platforms\": \"windows10\",\r\n              \"roleScopeTagIds\": [[\r\n                  \"0\"\r\n              ]],\r\n              \"technologies\": \"mdm,microsoftSense\",\r\n              \"templateReference\": {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationPolicyTemplateReference\",\r\n                  \"templateId\": \"[@sys.project([\"{IncludeResponseBodyInException:true}\" GET /beta/deviceManagement/configurationPolicyTemplates?$filter=baseId eq '6078910e-d808-4a9f-a51d-1b8a7bacb7c0'&$orderby=version desc&$top=1],\"id\")]\"\r\n                },\r\n              \"settings\": [[\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_authappsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultinboundaction_[@sys.first([\"1\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_defaultoutboundaction_[@sys.first([\"0\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_domainprofile_shielded_false\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"120c5dbe-0c88-46f0-b897-2c996d3e5277\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"7714c373-a19a-4b64-ba6d-2e9db04a7684\"\r\n                    }\r\n                  }\r\n                },\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_[@sys.first([\"1\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_[@sys.first([\"0\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_privateprofile_shielded_false\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"9d55dfae-d55f-4f2a-af03-9a9524f61e76\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"1c14f914-69bb-49f8-af5b-e29173a6ee95\" \r\n                    }\r\n                  }\r\n                },\r\n                {\r\n                  \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSetting\",\r\n                  \"settingInstance\": {\r\n                    \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                    \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall\",\r\n                    \"choiceSettingValue\": {\r\n                      \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                      \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true\",\r\n                      \"children\": [[\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_[@sys.first([\"1\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction\",\r\n                          \"choiceSettingValue\": {\r\n                            \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n                            \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_[@sys.first([\"0\"])]\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_false\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_true\"\r\n                          }\r\n                        },\r\n                        {\r\n                          \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n                          \"settingDefinitionId\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded\",\r\n                          \"choiceSettingValue\": {\r\n\t                        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingValue\",\r\n\t                        \"value\": \"vendor_msft_firewall_mdmstore_publicprofile_shielded_false\"\r\n                          }\r\n                        }\r\n                      ]],\r\n                      \"settingValueTemplateReference\": {\r\n                        \"settingValueTemplateId\": \"c38694c7-51a4-4a35-8f64-b10866a04776\"\r\n                      }\r\n                    },\r\n                    \"settingInstanceTemplateReference\": {\r\n                      \"settingInstanceTemplateId\": \"e2714734-708e-4286-8ae9-d56821e306a3\"\r\n                    }\r\n                  }\r\n                }\r\n              ]]}],\"id\")],\"policyId\") EOC {IncludeResponseBodyInException:true} POST /beta/deviceManagement/configurationPolicies/[@sys.read(\"policyId\")]/assign \\ {\r\n            \"assignments\":\r\n            [[\r\n                [@sys.join([@sys.concat([@getIncludeGroups([@sys.jsonArrayParse()])],[@getExcludeGroups([@sys.jsonArrayParse()])])])]\r\n            ]]\r\n        } EOC @sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '' and technologies eq 'mdm,microsoftSense' and platforms eq 'windows10'],\"id\")],\"policyId\") EOC @sys.read(\"policyId\") EOC @sys.append([/result]) EOC ",
          "subtaskCategory": 0,
          "requiredSkuRules": [
            {
              "requiredSkuFlags": 2
            }
          ],
          "dependentVersions": [],
          "id": "80d3458e-9523-4406-9f9d-260c2bdc0cde"
        }
      ]
    }
  ]
}