{
  "CosmosDbEntity": "managementTemplate",
  "priority": 136,
  "category": 0,
  "provider": 0,
  "version": 0,
  "displayName": "Local Administrator Password Solution (LAPS) Policy",
  "description": "A Microsoft-developed security tool that automatically manages and randomizes the local administrator account passwords for domain-joined computers, storing them in Active Directory (AD) or Microsoft Entra ID to prevent lateral movement by attackers. ",
  "userImpact": "None - As well as deploying this policy this feature needs to be enabled manually in Entra by turning on LAPS in Device Settings in the Device blade.",
  "id": "c23f23be-bd82-4796-b031-210de7fc2a0f",
  "managementTemplateSteps": [
    {
      "CosmosDbEntity": "managementTemplateStep",
      "priority": 1,
      "category": 1,
      "displayName": "Local Administrator Password Solution (LAPS) Policy",
      "description": "It is a Microsoft-developed security tool that automatically manages and randomizes the local administrator account passwords for domain-joined computers, storing them in Active Directory (AD) or Microsoft Entra ID to prevent lateral movement by attackers. ",
      "portalLink": {
        "url": "https://endpoint.microsoft.com/{tenantName}",
        "displayName": "Microsoft Intune"
      },
      "informationLinks": [],
      "id": "1a08d872-3c93-4e3f-bd6e-995537766879",
      "versions": [
        {
          "CosmosDbEntity": "managementTemplateStepVersion",
          "name": "Local Administrator Password Solution (LAPS) Policy",
          "version": 1,
          "similarToDefaultBaselineTaskSetting": false,
          "matchingDefaultBaselineSubtaskId": "",
          "settings": [
            {
              "name": "description",
              "value": "",
              "isRequired": false,
              "isReadOnly": false,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "Enabling LAPS for all Entra Joined devices removing admin privileges for all users"
            },
            {
              "name": "name",
              "value": "LAPS Policy",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": true,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "Name"
            },
            {
              "name": "platforms",
              "value": "windows10",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "Platforms"
            },
            {
              "name": "technologies",
              "value": "mdm",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "Technologies"
            },
            {
              "name": "templateReference.templateId",
              "value": "adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "templateId"
            },
            {
              "name": "templateReference.templateFamily",
              "value": "endpointSecurityAccountProtection",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "templateFamily"
            },
            {
              "name": "templateReference.templateDisplayName",
              "value": "Local admin password solution (Windows LAPS)",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "templateDisplayName"
            },
            {
              "name": "templateReference.templateDisplayVersion",
              "value": "Version 1",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "templateDisplayVersion"
            },
            {
              "name": "settings.1.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId",
              "value": "a3270f64-e493-499d-8900-90290f61ed8a",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingInstanceTemplateId"
            },
            {
              "name": "settings.1.settingInstance.choiceSettingValue.value",
              "value": "device_vendor_msft_laps_policies_backupdirectory_1",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [
                {
                  "name": "device_vendor_msft_laps_policies_backupdirectory_1",
                  "displayName": "Backup the password to Microsoft Entra ID only"
                }
              ],
              "displayName": "Backup Directory "
            },
            {
              "name": "settings.1.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId",
              "value": "4d90f03d-e14c-43c4-86da-681da96a2f92",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingValueTemplateId"
            },
            {
              "name": "settings.1.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault",
              "value": "False",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "Boolean",
              "referenceStrings": [],
              "displayName": "useTemplateDefault"
            },
            {
              "name": "settings.1.settingInstance.choiceSettingValue.children.1.odata.type",
              "value": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "@odata.type"
            },
            {
              "name": "settings.1.settingInstance.choiceSettingValue.children.1.settingDefinitionId",
              "value": "device_vendor_msft_laps_policies_passwordagedays_aad",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingDefinitionId"
            },
            {
              "name": "settings.1.settingInstance.choiceSettingValue.children.1.simpleSettingValue.odata.type",
              "value": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "@odata.type"
            },
            {
              "name": "settings.1.settingInstance.choiceSettingValue.children.1.simpleSettingValue.value",
              "value": "30",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "Integer",
              "referenceStrings": [],
              "displayName": "Setting value"
            },
            {
              "name": "settings.2.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId",
              "value": "d3d7d492-0019-4f56-96f8-1967f7deabeb",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingInstanceTemplateId"
            },
            {
              "name": "settings.2.settingInstance.simpleSettingValue.odata.type",
              "value": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "@odata.type"
            },
            {
              "name": "settings.2.settingInstance.simpleSettingValue.value",
              "value": "Admin",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "Setting value"
            },
            {
              "name": "settings.2.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId",
              "value": "992c7fce-f9e4-46ab-ac11-e167398859ea",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingValueTemplateId"
            },
            {
              "name": "settings.2.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault",
              "value": "False",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "Boolean",
              "referenceStrings": [],
              "displayName": "useTemplateDefault"
            },
            {
              "name": "settings.3.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId",
              "value": "8a7459e8-1d1c-458a-8906-7b27d216de52",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingInstanceTemplateId"
            },
            {
              "name": "settings.3.settingInstance.choiceSettingValue.value",
              "value": "device_vendor_msft_laps_policies_passwordcomplexity_4",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [
                {
                  "name": "device_vendor_msft_laps_policies_passwordcomplexity_4",
                  "displayName": "Large letters + small letters + numbers + special characters"
                }
              ],
              "displayName": "Password Complexity "
            },
            {
              "name": "settings.3.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId",
              "value": "aa883ab5-625e-4e3b-b830-a37a4bb8ce01",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingValueTemplateId"
            },
            {
              "name": "settings.3.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault",
              "value": "False",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "Boolean",
              "referenceStrings": [],
              "displayName": "useTemplateDefault"
            },
            {
              "name": "settings.4.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId",
              "value": "da7a1dbd-caf7-4341-ab63-ece6f994ff02",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingInstanceTemplateId"
            },
            {
              "name": "settings.4.settingInstance.simpleSettingValue.odata.type",
              "value": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "@odata.type"
            },
            {
              "name": "settings.4.settingInstance.simpleSettingValue.value",
              "value": "14",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "Integer",
              "referenceStrings": [],
              "displayName": "Setting value"
            },
            {
              "name": "settings.4.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId",
              "value": "d08f1266-5345-4f53-8ae1-4c20e6cb5ec9",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingValueTemplateId"
            },
            {
              "name": "settings.4.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault",
              "value": "False",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "Boolean",
              "referenceStrings": [],
              "displayName": "useTemplateDefault"
            },
            {
              "name": "settings.5.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId",
              "value": "d9282eb1-d187-42ae-b366-7081f32dcfff",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingInstanceTemplateId"
            },
            {
              "name": "settings.5.settingInstance.choiceSettingValue.value",
              "value": "device_vendor_msft_laps_policies_postauthenticationactions_3",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [
                {
                  "name": "device_vendor_msft_laps_policies_postauthenticationactions_3",
                  "displayName": "Reset the password and logoff the managed account: upon expiry of the grace period, the managed account password will be reset and any interactive logon sessions using the managed account will terminated."
                }
              ],
              "displayName": "Post Authentication Actions "
            },
            {
              "name": "settings.5.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId",
              "value": "68ff4f78-baa8-4b32-bf3d-5ad5566d8142",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingValueTemplateId"
            },
            {
              "name": "settings.5.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault",
              "value": "False",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "Boolean",
              "referenceStrings": [],
              "displayName": "useTemplateDefault"
            },
            {
              "name": "settings.6.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId",
              "value": "a9e21166-4055-4042-9372-efaf3ef41868",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingInstanceTemplateId"
            },
            {
              "name": "settings.6.settingInstance.simpleSettingValue.odata.type",
              "value": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "@odata.type"
            },
            {
              "name": "settings.6.settingInstance.simpleSettingValue.value",
              "value": "4",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "Integer",
              "referenceStrings": [],
              "displayName": "Setting value"
            },
            {
              "name": "settings.6.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId",
              "value": "0deb6aee-8dac-40c4-a9dd-c3718e5c1d52",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingValueTemplateId"
            },
            {
              "name": "settings.6.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault",
              "value": "False",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "Boolean",
              "referenceStrings": [],
              "displayName": "useTemplateDefault"
            },
            {
              "name": "settings.7.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId",
              "value": "0d70f6fb-8f35-4fba-8ada-494b8a478703",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingInstanceTemplateId"
            },
            {
              "name": "settings.7.settingInstance.choiceSettingValue.value",
              "value": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled_false",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [
                {
                  "name": "device_vendor_msft_laps_policies_automaticaccountmanagementenabled_false",
                  "displayName": "The target account will not be automatically managed"
                }
              ],
              "displayName": "Automatic Account Management Enabled"
            },
            {
              "name": "settings.7.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId",
              "value": "5db30960-1e02-4100-9e2c-a2212596b054",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "settingValueTemplateId"
            },
            {
              "name": "settings.7.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault",
              "value": "False",
              "isRequired": false,
              "isReadOnly": true,
              "isIdentifier": false,
              "settingType": "Boolean",
              "referenceStrings": [],
              "displayName": "useTemplateDefault"
            },
            {
              "name": "includeGroups",
              "value": "[\"All\"]",
              "isRequired": false,
              "isReadOnly": false,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [
                {
                  "name": "Groups_AllGroups",
                  "displayName": "All groups"
                }
              ],
              "displayName": "Include groups"
            },
            {
              "name": "excludeGroups",
              "isRequired": false,
              "isReadOnly": false,
              "isIdentifier": false,
              "settingType": "String",
              "referenceStrings": [],
              "displayName": "Exclude groups"
            }
          ],
          "deploymentAction": {
            "operationDefinition": {
              "values": [
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '[@name()]'],\"id\")],\"deviceManagementId\")",
                "{IncludeResponseBodyInException:true} PUT /beta/deviceManagement/configurationPolicies/[@sys.read(\"deviceManagementId\")] \\ {\r\n  \"description\": \"[@description()]\",\r\n  \"name\": \"[@name()]\",\r\n  \"platforms\": \"[@platforms()]\",\r\n  \"technologies\": \"[@technologies()]\",\r\n  \"templateReference\": {\r\n    \"templateId\": \"[@templateReference.templateId()]\",\r\n    \"templateFamily\": \"[@templateReference.templateFamily()]\",\r\n    \"templateDisplayName\": \"[@templateReference.templateDisplayName()]\",\r\n    \"templateDisplayVersion\": \"[@templateReference.templateDisplayVersion()]\"\r\n  },\r\n  \"settings\": [[\r\n    {\r\n      \"id\": \"0\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_backupdirectory\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.1.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.1.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.1.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.1.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[\r\n            {\r\n              \"@odata.type\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.odata.type()]\",\r\n              \"settingDefinitionId\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.settingDefinitionId()]\",\r\n              \"simpleSettingValue\": {\r\n                \"@odata.type\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.simpleSettingValue.odata.type()]\",\r\n                \"value\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.simpleSettingValue.value()]\"\r\n              }\r\n            }\r\n          ]]\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"1\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_administratoraccountname\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.2.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"simpleSettingValue\": {\r\n          \"@odata.type\": \"[@settings.2.settingInstance.simpleSettingValue.odata.type()]\",\r\n          \"value\": \"[@settings.2.settingInstance.simpleSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.2.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.2.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          }\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"2\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_passwordcomplexity\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.3.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.3.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.3.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.3.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[]]\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"3\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_passwordlength\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.4.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"simpleSettingValue\": {\r\n          \"@odata.type\": \"[@settings.4.settingInstance.simpleSettingValue.odata.type()]\",\r\n          \"value\": \"[@settings.4.settingInstance.simpleSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.4.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.4.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          }\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"4\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_postauthenticationactions\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.5.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.5.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.5.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.5.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[]]\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"5\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_postauthenticationresetdelay\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.6.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"simpleSettingValue\": {\r\n          \"@odata.type\": \"[@settings.6.settingInstance.simpleSettingValue.odata.type()]\",\r\n          \"value\": \"[@settings.6.settingInstance.simpleSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.6.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.6.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          }\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"6\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_automaticaccountmanagementenabled\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.7.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.7.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.7.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.7.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[]]\r\n        }\r\n      }\r\n    }\r\n  ]]\r\n}",
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} POST /beta/deviceManagement/configurationPolicies[@sys.notexists(\"deviceManagementId\")] \\ {\r\n  \"description\": \"[@description()]\",\r\n  \"name\": \"[@name()]\",\r\n  \"platforms\": \"[@platforms()]\",\r\n  \"technologies\": \"[@technologies()]\",\r\n  \"templateReference\": {\r\n    \"templateId\": \"[@templateReference.templateId()]\",\r\n    \"templateFamily\": \"[@templateReference.templateFamily()]\",\r\n    \"templateDisplayName\": \"[@templateReference.templateDisplayName()]\",\r\n    \"templateDisplayVersion\": \"[@templateReference.templateDisplayVersion()]\"\r\n  },\r\n  \"settings\": [[\r\n    {\r\n      \"id\": \"0\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_backupdirectory\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.1.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.1.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.1.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.1.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[\r\n            {\r\n              \"@odata.type\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.odata.type()]\",\r\n              \"settingDefinitionId\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.settingDefinitionId()]\",\r\n              \"simpleSettingValue\": {\r\n                \"@odata.type\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.simpleSettingValue.odata.type()]\",\r\n                \"value\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.simpleSettingValue.value()]\"\r\n              }\r\n            }\r\n          ]]\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"1\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_administratoraccountname\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.2.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"simpleSettingValue\": {\r\n          \"@odata.type\": \"[@settings.2.settingInstance.simpleSettingValue.odata.type()]\",\r\n          \"value\": \"[@settings.2.settingInstance.simpleSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.2.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.2.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          }\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"2\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_passwordcomplexity\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.3.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.3.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.3.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.3.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[]]\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"3\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_passwordlength\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.4.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"simpleSettingValue\": {\r\n          \"@odata.type\": \"[@settings.4.settingInstance.simpleSettingValue.odata.type()]\",\r\n          \"value\": \"[@settings.4.settingInstance.simpleSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.4.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.4.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          }\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"4\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_postauthenticationactions\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.5.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.5.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.5.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.5.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[]]\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"5\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_postauthenticationresetdelay\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.6.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"simpleSettingValue\": {\r\n          \"@odata.type\": \"[@settings.6.settingInstance.simpleSettingValue.odata.type()]\",\r\n          \"value\": \"[@settings.6.settingInstance.simpleSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.6.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.6.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          }\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"6\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_automaticaccountmanagementenabled\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.7.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.7.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.7.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.7.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[]]\r\n        }\r\n      }\r\n    }\r\n  ]]\r\n}],\"id\")],\"deviceManagementId\")",
                "POST /beta/deviceManagement/configurationPolicies/[@sys.read(\"deviceManagementId\")]/assign  \\ \n              { \n                \"assignments\":\n                [[\n                    [@sys.join([@sys.concat([@getIncludeGroups([@sys.jsonArrayParse([@includeGroups()])])],[@getExcludeGroups([@sys.jsonArrayParse([@excludeGroups()])])])])]\n                ]]\n              }"
              ],
              "lambdaDefinitions": [
                {
                  "type": 0,
                  "id": "getIncludeGroups",
                  "value": "select case\n\t                            when data like 'All' then '{ \n\t\t                            \"target\":\n                                    {\n\t\t\t                            \"@odata.type\": \"#microsoft.graph.allLicensedUsersAssignmentTarget\"\n\t\t                            }\n\t                            }'\n                                when data = '' then ''\n\t                            else '{ \n\t\t                            \"target\":\n                                    {\n\t\t\t                            \"@odata.type\": \"#microsoft.graph.groupAssignmentTarget\",\n                                        \"groupId\": \"' || data || '\"\n\t\t                            }\n\t                            }'\n                            end\n                            from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludeGroups",
                  "value": "select case\n                            when data = '' then ''\n                            else '{ \n\t\t                            \"target\":\n                                    {\n\t\t\t                            \"@odata.type\": \"#microsoft.graph.exclusionGroupAssignmentTarget\",\n                                        \"groupId\": \"' || data || '\"\n\t\t                            }\n\t                            }'\n                            end\n                            from arg0"
                }
              ],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "aggregationDefinition": {
              "value": "@sys.append([/result])",
              "values": [],
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            }
          },
          "validationAction": {
            "operationDefinition": {
              "values": [
                "@sys.write([@sys.normalize([/beta/deviceManagement/configurationPolicies?$expand=assignments])],\"policies\")",
                "@sys.write([@sys.normalize([/v1.0/users?$select=id,displayName,userPrincipalName,assignedPlans,assignedLicenses,userType&$expand=memberOf($select=roleTemplateId)])],\"allUsers\")",
                "@sys.validateDeviceConfigurationPolicy([POST /echo \\ {\r\n  \"description\": \"[@description()]\",\r\n  \"name\": \"[@name()]\",\r\n  \"platforms\": \"[@platforms()]\",\r\n  \"technologies\": \"[@technologies()]\",\r\n  \"templateReference\": {\r\n    \"templateId\": \"[@templateReference.templateId()]\",\r\n    \"templateFamily\": \"[@templateReference.templateFamily()]\",\r\n    \"templateDisplayName\": \"[@templateReference.templateDisplayName()]\",\r\n    \"templateDisplayVersion\": \"[@templateReference.templateDisplayVersion()]\"\r\n  },\r\n  \"settings\": [[\r\n    {\r\n      \"id\": \"0\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_backupdirectory\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.1.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.1.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.1.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.1.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[\r\n            {\r\n              \"@odata.type\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.odata.type()]\",\r\n              \"settingDefinitionId\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.settingDefinitionId()]\",\r\n              \"simpleSettingValue\": {\r\n                \"@odata.type\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.simpleSettingValue.odata.type()]\",\r\n                \"value\": \"[@settings.1.settingInstance.choiceSettingValue.children.1.simpleSettingValue.value()]\"\r\n              }\r\n            }\r\n          ]]\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"1\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_administratoraccountname\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.2.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"simpleSettingValue\": {\r\n          \"@odata.type\": \"[@settings.2.settingInstance.simpleSettingValue.odata.type()]\",\r\n          \"value\": \"[@settings.2.settingInstance.simpleSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.2.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.2.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          }\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"2\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_passwordcomplexity\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.3.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.3.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.3.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.3.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[]]\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"3\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_passwordlength\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.4.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"simpleSettingValue\": {\r\n          \"@odata.type\": \"[@settings.4.settingInstance.simpleSettingValue.odata.type()]\",\r\n          \"value\": \"[@settings.4.settingInstance.simpleSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.4.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.4.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          }\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"4\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_postauthenticationactions\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.5.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.5.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.5.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.5.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[]]\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"5\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_postauthenticationresetdelay\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.6.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"simpleSettingValue\": {\r\n          \"@odata.type\": \"[@settings.6.settingInstance.simpleSettingValue.odata.type()]\",\r\n          \"value\": \"[@settings.6.settingInstance.simpleSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.6.settingInstance.simpleSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.6.settingInstance.simpleSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          }\r\n        }\r\n      }\r\n    },\r\n    {\r\n      \"id\": \"6\",\r\n      \"settingInstance\": {\r\n        \"@odata.type\": \"#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance\",\r\n        \"settingDefinitionId\": \"device_vendor_msft_laps_policies_automaticaccountmanagementenabled\",\r\n        \"settingInstanceTemplateReference\": {\r\n          \"settingInstanceTemplateId\": \"[@settings.7.settingInstance.settingInstanceTemplateReference.settingInstanceTemplateId()]\"\r\n        },\r\n        \"choiceSettingValue\": {\r\n          \"value\": \"[@settings.7.settingInstance.choiceSettingValue.value()]\",\r\n          \"settingValueTemplateReference\": {\r\n            \"settingValueTemplateId\": \"[@settings.7.settingInstance.choiceSettingValue.settingValueTemplateReference.settingValueTemplateId()]\",\r\n            \"useTemplateDefault\": \"[@settings.7.settingInstance.choiceSettingValue.settingValueTemplateReference.useTemplateDefault()]\"\r\n          },\r\n          \"children\": [[]]\r\n        }\r\n      }\r\n    }\r\n  ]]\r,\"assignments\":[[ [@sys.join([@sys.concat([@getIncludeGroups([@sys.jsonArrayParse([@includeGroups()])])],[@getExcludeGroups([@sys.jsonArrayParse([@excludeGroups()])])])])] ]]\n}],[@sys.read(\"policies\")],[@sys.read(\"allUsers\")])"
              ],
              "lambdaDefinitions": [
                {
                  "type": 0,
                  "id": "getIncludeGroups",
                  "value": "select case\r\n\t                    when data like 'All' then '{ \r\n\t\t                    \"target\":\r\n                            {\r\n\t\t\t                    \"@odata.type\": \"#microsoft.graph.allLicensedUsersAssignmentTarget\"\r\n\t\t                    }\r\n\t                    }'\r\n\t                    else '{ \r\n\t\t                    \"target\":\r\n                            {\r\n\t\t\t                    \"@odata.type\": \"#microsoft.graph.groupAssignmentTarget\",\r\n                                \"groupId\": \"' || data || '\"\r\n\t\t                    }\r\n\t                    }'\r\n                    end\r\n                    from arg0"
                },
                {
                  "type": 0,
                  "id": "getExcludeGroups",
                  "value": "select case\r\n                    when data = '' then ''\r\n                    else '{ \r\n\t\t                    \"target\":\r\n                            {\r\n\t\t\t                    \"@odata.type\": \"#microsoft.graph.exclusionGroupAssignmentTarget\",\r\n                                \"groupId\": \"' || data || '\"\r\n\t\t                    }\r\n\t                    }'\r\n                    end\r\n                    from arg0"
                }
              ],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "aggregationDefinition": {
              "value": "@sys.append([/result])",
              "values": [],
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "isAvailableOffline": true
          },
          "extractionAction": {
            "operationDefinition": {
              "values": [
                "/beta/deviceManagement/configurationPolicies/5ffb16a0-b264-4136-8e5a-22026c9c4c5e?$expand=settings($expand=settingDefinitions),assignments"
              ],
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "aggregationDefinition": {
              "value": "@sys.append([/result])",
              "values": [],
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            }
          },
          "deletionAction": {
            "operationDefinition": {
              "values": [
                "@sys.write([@sys.project([{IncludeResponseBodyInException:true} GET /beta/deviceManagement/configurationPolicies?$filter=name eq '[@name()]'],\"id\")],\"deviceManagementId\")",
                "{IncludeResponseBodyInException:true} DELETE /beta/deviceManagement/configurationPolicies/[@sys.read(\"deviceManagementId\")]"
              ],
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            },
            "aggregationDefinition": {
              "value": "@sys.append([/result])",
              "lambdaDefinitions": [],
              "managedTenantOperationLogLevel": 0,
              "failOnError": false
            }
          },
          "processedDeploymentAction": "",
          "subtaskCategory": 0,
          "requiredSkuRules": [
            {
              "requiredSkuFlags": 2
            }
          ],
          "dependentVersions": [],
          "id": "3c449bc3-6964-4c00-9af4-17ed84e9ff67"
        }
      ]
    }
  ]
}